[{"sent_1":"Helen wears a size 4 so Leanne who wears a size 6 probably can't fit into Helen's jeans.","sent_2":"Helen wears a size 8 so Leanne who wears a size 6 probably can't fit into Helen's jeans.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If he lost two of the fingers in his right hand in an accident 2 years ago, he would not have 10 fingers  today.","sent_2":"If he lost two of the fingers in his right hand in an accident 2 years ago, he would still have 10 fingers today.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"A human being has a much easier time swallowing fifty mangos than they do swallowing fifty grains of rice.","sent_2":"A human being has a much easier time swallowing fifty grains of rice than they do swallowing fifty mangos.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"A chair is more likely to break with 3 people sitting in it than 1 person.","sent_2":"A chair is less likely to break with 3 people sitting in it than 1 person.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If a jaguar at 5 miles distance start running to me at 5 miles per hour, it will take 1 hour to reach me.","sent_2":"If a jaguar at 5 miles distance start running to me at 5 miles per hour, it will take 2 hours to reach me.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"I bought a new mattress, which measures 10 feet long by 10 feet wide, and the doorway to my apartment is 84 inches high and 40 inches across,so I won't have any trouble getting it into the apartment. ","sent_2":"I bought a new mattress, which measures 10 feet long by 10 feet wide, and the doorway to my apartment is 84 inches high and 40 inches across,so I won't be able to get it into my apartment.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Jen waited 20 minutes before drinking the frozen water so it was spoiled.","sent_2":"Jen waited 20 minutes before drinking the frozen water so it was good to drink.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Jared can't lift the 45 inch TV by himself, so he probably will be able to lift a 65 inch TV.","sent_2":"Jared can't lift the 45 inch TV by himself, so he probably won't be able to lift a 65 inch TV.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If the wood on the balcony is rotten, it is not a good idea to put a table on it that weighs 500 lbs.","sent_2":"If the wood on the balcony is rotten, it is a good idea to put a table on it that weighs 500 lbs.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If I would like to become a professional musician, I could purchase a piano with seven keys.","sent_2":"If I would like to become a professional musician, I could purchase a piano with eighty-eight keys.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"He can lift a 70 pound box, so he should be able to carry the chair.","sent_2":"He can lift a 70 pound box, so he should be able to carry the granite slab.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"An amateur juggler might be able to juggle four snowballs of the same size and weight.","sent_2":"An amateur juggler might be able to juggle four televisions of the same size and weight.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"To get more light at the desk it is a good idea to put the lamp two feet away.","sent_2":"To get more light at the desk it is a good idea to put the lamp two hundred feet away.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Susie is very hungry so she can eat 2 whole hamburgers.","sent_2":"Susie is hungry so she can eat 5 whole hamburgers","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If Tim's recipe calls for a half dozen eggs but he only has two eggs, he needs to buy a half of a dozen more eggs.","sent_2":"If Tim's recipe calls for a half dozen eggs but he only has two eggs, he needs to buy a third of a dozen more eggs.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If the tables in a restaurant seat six people, a family of four can comfortably be seated at the table. ","sent_2":"If the tables in a restaurant seat six people, a soccer team consisting of thirteen players can be seated at two tables.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Veronica’s dentist told her that in order to keep her teeth healthy, she should brush and floss two times a day. ","sent_2":"Veronica’s dentist told her that in order to keep her teeth healthy, she should brush and floss twenty times a day. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"The 500 g bag of sugar is two thirds full. If you need 300 g of sugar, you would need another 500 g bag of sugar.","sent_2":"The 500 g bag of sugar is two thirds full. If you need 300 g of sugar, you would need not another 500 g bag of sugar.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Sam is going on a camping trip and needs a tent but since he doesn't have one he uses a plastic sheet draped over a cord instead.","sent_2":"Sam is going on a camping trip and needs a tent but since he doesn't have one he uses an umbrella instead.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"When transporting a small fragile glass, it is easier for ten people to help carry it.","sent_2":"When transporting a small fragile glass, it is easier for one person to carry it.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Although six pallbearers can carry the coffin, it should be easier for eight pallbearers to do so.","sent_2":"Although six pallbearers can carry the coffin, it should for two pallbearers to do so.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"If the dress is a size six and it is too snug, a size eight would be better.","sent_2":"If the dress is a size six and it is too snug, a size four would be better.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"The recipe calls for 1 cup of sugar, so 4 ounces of sugar should be enough.","sent_2":"The recipe calls for 1 cup of sugar, so 8 ounces of sugar should be enough.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"a fire ant can carry up to 100 times its weight so it definetely can not carry two human beings ","sent_2":"a fire ant can carry up to 100 times its weight so it definetely can carry 101 insects of its species","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"He knew if he went for a walk, he would cover about 100 miles in an hour.","sent_2":"He knew if he went for a walk, he would cover about 2 miles in an hour.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"A man who can bench press two hundred pounds can easily lift a small child.","sent_2":"A man who can bench press two hundred pounds cannot easily lift a small child.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Daniel can walk one mile in thirty minutes.","sent_2":"Daniel can walk five miles in less than fifteen minutes.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"True"},{"sent_1":"Because he can carry the dining table himself, it should be easy for him to lift a dining chair.","sent_2":"Because he cannot carry the dining table himself, it should be easy for him to lift a dining chair.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If his shoulder is sore, lifting heavy weights may make it worse.","sent_2":"If his shoulder is sore, lifting heavy weights may make it better.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When you water your outdoor plants you should use a watering can to obtain water.","sent_2":"When you water your outdoor plants you should use a sink to obtain water.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you don't have glue, you could try using tape instead.","sent_2":"If you don't have glue, you should not try using tape instead.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"My son wanted a pet, but since we live in an apartment we are only allowed to have caged animals, so I bought him a gerbil. ","sent_2":"My son wanted a pet, but since we live in an apartment we are only allowed to have caged animals, so I bought him a dog. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"when walking on hot sand you should not be wearing socks","sent_2":"when walking on hot sand you should be wearing socks","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"To cover the risk of accidental damages, he opened a bank account.","sent_2":"To cover the risk of accidental damages, he purchased an insurance policy.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If it is dark outside, a flashlight will help you see.","sent_2":"If it is bright outside, a flashlight will help you see.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since she didn't have a thimble she could try protecting her finger with a spoon.","sent_2":"Since she didn't have a thimble she could try protecting her finger with some cotton.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you are trying to hide a kitchen chair, you can always put it inside of a bush.","sent_2":"If you are trying to hide a kitchen chair, you can always put it inside of the stove.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you put mud on a hamburger, it will make it more appealing.","sent_2":"If you put mud on a hamburger, it will make it less appealing.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Brandy was swimming in the ocean and started panicking when she noticed a shark swimming towards her. ","sent_2":"Brandy was swimming in a swimming pool and started panicking when she noticed a shark swimming towards her. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"For a science project, I decided to surround an egg with glass so that it would be protected when I dropped it from a height.","sent_2":"For a science project, I decided to surround an egg with styrofoam so that it would be protected when I dropped it from a height.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"There is no snow on the mountain, so we cannot snowboard down it.","sent_2":"Since there is snow in the mountains, we cannot snowboard down it.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since I bump my head in my bathroom's doorway, I should consider raising it.","sent_2":"Since I bump my head in my bathroom's doorway, I should consider lowering it.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"It's very near, you can't go there on foot ","sent_2":"It's very near, you can go there on foot ","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"It is possible that smoking cigarettes can cause lung cancer.","sent_2":"It is not possible that smoking cigarettes can cause lung cancer.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When the weather is cold, wearing gloves can help keep me warm. ","sent_2":"When the weather is cold, wearing gloves can help keep me cool. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If I comb my Sphynx cat, the comb will be empty of fur.","sent_2":"If I comb my Sphynx cat, the comb will be full of fur.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If it is hot outside, opening the windows will not cool you down.","sent_2":"If it is hot outside, opening the windows will cool you down.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"In a supermarket, a gallon bottle of coke is cheaper than a can of coke in terms of price per ounce.","sent_2":"In a supermarket, a gallon bottle of coke is more expensive than a can of coke in terms of price per ounce.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"You should have a spare tire to use in case your tire goes flat.","sent_2":"You should have a spare battery to use in case your tire goes flat.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"It requires more effort to finish a work in half time.","sent_2":"It requires less effort to finish a work in half time","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Jane loved to upset her parents with loud noises so she threw a paper plate on the floor. ","sent_2":"Jane loved to upset her parents with loud noises so she threw a ceramic plate on the floor. ","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If my pen runs out of ink, I can use my lipstick to take notes instead.","sent_2":"If my pen runs out of ink, I can use my comb to take notes instead.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If your plants are turning brown, pour water on them.","sent_2":"If your plants are turning brown, pour oil on them.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Samantha's fingers have gotten so cold that they are becoming numb.  If she wants to warm them up, she cannot just put them in the microwave.","sent_2":"Samantha's fingers have gotten so cold that they are becoming numb.  If she wants to warm them up, she can just put them in the microwave.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"An hour after the sun goes down on a very hot day, the cement sidewalk will still feel warm to the touch.","sent_2":"An hour after the sun goes down on a very hot day, the grassy lawn will still feel warm to the touch.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":" Since she didn't have a knife, she could try to cut the bread with a 'saws-all' blade.","sent_2":" Since she didn't have a knife, she could try to cut the bread with a spoon.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If Hazel cannot cook her eggs on the stove, she can cook them in the microwave.","sent_2":"If Hazel cannot cook her eggs on the stove, she can cook them in the toaster.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Greta needed to lower her salt intake due to her poor health, so she decided it would be wise to have an apple for a snack. ","sent_2":"Greta needed to lower her salt intake due to her poor health, so she decided it would be wise to have potato chips for a snack. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since Phoebe did not have a hair elastic, she could try to put her hair in a pony tail with a rubber band. ","sent_2":"Since Phoebe did not have a hair elastic, she could try to put her hair in a pony tail with a paper clip.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since all my clothes are dirty, in a pinch I can cover myself with some plates and bowls instead.","sent_2":"Since all my clothes are dirty, in a pinch I can cover myself with a bed sheet instead.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"The kids got their ball out of the tall tree with a long pole.","sent_2":"The kids got their ball out of the tall tree with a short pole.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you pull the trigger of an unloaded gun, you'll hear a click and it won't fire.","sent_2":"If you pull the trigger of a loaded gun, you'll hear a click and it won't fire.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"birds will fly south in the wintertime ","sent_2":"birds will fly north in the wintertime","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since the basketball is completely deflated, we cannot bounce it on the basketball court.","sent_2":"Since the basketball is fully inflated, we cannot bounce it on the basketball court.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When Bob wanted to play with his cat he used a piece of string.","sent_2":"When Bob wanted to play with his cat he used a board game.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"He had misplaced his keys so he had to break the lock","sent_2":"He had found his keys so he had to break the lock","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Jake didn't have a dust pan, so he used a paper plate to pick up what he swept. ","sent_2":"Jake didn't have a dust pan, so he used a sponge to pick up what he swept. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Frank wanted to cool off the pie, so he put it in the fridge. ","sent_2":"Frank wanted to cool off the pie, so he put it in the hot oven. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"A man needed to weigh down a piece of paper, he used a paperclip. ","sent_2":"A man needed to weigh down a piece of paper, he used a brick.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"He knows how to ride a bike, so surely he can ride a tricycle.","sent_2":"He knows how to ride a bike, so surely he can ride a unicycle.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since my dog doesn't shed, her fur is often on my clothes.","sent_2":"Since my dog doesn't shed, her fur is rarely on my clothes.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If it is dark outside opening the blinds will not help you see.","sent_2":"If it is dark outside opening the blinds will help you see.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"On a sunny day, plants can make carbohydrates out of water and carbon dioxide.","sent_2":"On a sunny day, rabbits can make carbohydrates out of water and carbon dioxide.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"As somebody who likes to keep their liquids secure, ensuring that all lids are kept on tightly is paramount to preventing spills.","sent_2":"As somebody who likes to keep their liquids secure, ensuring that all lids are kept on loosely is paramount to preventing spills.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you want to open the fridge, then you should use the hand to open it","sent_2":"If you want to open the fridge, then you should use the stick to open it","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When you go outside and want to prevent sunburn you should put on sunscreen","sent_2":"When you go outside and want to enhance sunburn you should put on sunscreen","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Tim's computer was slowing down so he scanned his computer for viruses.","sent_2":"Tim's computer was slowing down so he scanned his computer for glitches.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If it rains outside, wearing sunscreen would not help you stay dry.","sent_2":"If it rains outside, wearing sunscreen would help you stay dry.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If the land is heated, it will create an area of low pressure near the land.","sent_2":"If the land is heated, it will create an area of high pressure near the land.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"My t-shirt is dirty so I will wash it.","sent_2":"My t-shirt is dirty so I will wear it.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Washing clothes will make them smell better. ","sent_2":"Washing clothes will make them smell worse. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since he didn't have a nail, he could use a screw to put hang a picture up.","sent_2":"Since he didn't have a nail, he could use a needle to hang a picture up..","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"It is safe to walk on the ice if it is 12 inches thick","sent_2":"It is safe to walk on the ice if it is an inches thick","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you are outside during the storm, you need to shelter somewhere","sent_2":"If you are outside during the storm, you need to stand under the tree","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If it is a sunny day, you should sit in the shade to avoid sunburn.","sent_2":"If it is a snowy day, you should sit in the shade to avoid sunburn.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since Megan was a vegetarian, she refused to eat a hamburger. ","sent_2":"Since Megan was a vegetarian, she refused to eat a cucumber. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"The child's scream was so high-pitched that our ears hurt","sent_2":"The child's scream was so low-pitched that our ears hurt","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you look at your screen for hours at a time, you should dim your screen to preserve your eyesight.","sent_2":"If you look at your screen for hours at a time, you should brighten your screen to preserve your eyesight.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If I need to make some noise to get my kids attention, if I bang on a pot with a spoon, they'll probably hear me.","sent_2":"If I need to make some noise to get my kids attention, if I bang on a pot with a piece of paper, they'll probably hear me.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you put a cover on your pool there will be less chance for leaves to get in it.","sent_2":"If you do not put a cover on your pool there will be less chance for leaves to get in it.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Mary's heating system is broken, she cannot therefore use the toaster to heat her home.","sent_2":"Mary's heating system is broken, she can therefore use the toaster to heat her home.  ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"While in a windy rainstorm, you should always point your umbrella away from the wind.","sent_2":"While in a windy rainstorm, you should always point your umbrella into the wind.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you don't have a piece of tape, you can use paste to attach the paper to the board.","sent_2":"If you don't have a piece of tape, you can use a q-tip to attach the paper to the board.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Jack wanted a utensil that was more sustainable to he bought a hemp straw.","sent_2":"Jack wanted a utensil that was more sustainable to he bought a plastic straw.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If I poke a balloon with a needle I would anticipate a loud popping noise soon after.","sent_2":"If I poke a balloon with a needle I would anticipate a soft noise soon after.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you talk softer, less people will hear you. ","sent_2":"If you talk softer, more people will hear you. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you have trouble staying alert while working you should turn all of your lights on.","sent_2":"If you have trouble staying alert while working you should turn all of your lights off.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If my friends and I are outside with a backpack full of popsicles and baseball equipment, we should eat the popsicles first and play baseball for a couple of hours afterwards.","sent_2":"If my friends and I are outside with a backpack full of popsicles and baseball equipment, we should play baseball for a couple of hours first and eat the popsicles afterwards.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When I open and close the door, the hinges squeak and squeal, to solve this I needed to add lubricants to the hinges. ","sent_2":"When I open and close the door, the hinges squeak and squeal, to solve this I needed to remove lubricants from the hinges. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Jan needed to serve the spaghetti to her family so she grabbed a knife.","sent_2":"Jan needed to serve the spaghetti to her family so she grabbed a fork.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"I couldn't find a hammer, so I used a steel block to drive the nail.","sent_2":"I couldn't find a hammer, so I used a pillow to drive the nail.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"As a visually impaired person, I've always found it difficult to see, so having a very dim television screen works best for me.","sent_2":"As a visually impaired person, I've always found it difficult to see, so having a very illuminated television screen works best for me.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Brian's fingers were too big to grab the tiny spring,  so he used a pair of tweezers. ","sent_2":"Brian's fingers were too big to grab the tiny spring,  so he used a catcher's mitt. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"You just ran out of coffee filters, so you can use a paper towel as a substitute.","sent_2":"You just ran out of coffee filters, so you can use a laminated paper as a substitute.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If it is sunny outside, wearing a wide-brimmed hat should protect my face from sunburn. ","sent_2":"If it is sunny outside, wearing a long-sleeved shirt should protect my face from sunburn. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When you order a food delivery and there is traffic jam, you should expect the food to be delivered as cold.","sent_2":"When you order a food delivery and there is traffic jam, you should expect the food to be delivered as warm.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"My new video game is too graphically intensive to operate on my computer, so now I have to upgrade.","sent_2":"My new video game is too graphically intensive to operate on my computer, so now I have to downgrade. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you don't have a cup, you can use a dipper to drink water out of.","sent_2":"If you don't have a cup, you can use a spoon to drink water out of.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When Mary picks blueberries, she gathers them into a five-gallon bucket as she usually picks thousands of berries.","sent_2":"When Mary picks blueberries, she gathers them into a quart bowl as she usually picks thousands of berries.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you pour water over a hard rock, the rock will disappear.","sent_2":"If you pour water over a hard rock, the rock will not disappear.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Because she can carry a coffin, carrying a baby kitten would be very easy. ","sent_2":"Because she can carry a coffin, carrying a baby kitten would be very hard. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"You can grill a steak by putting it in the fridge.","sent_2":"You can not grill a steak by putting it in the fridge.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Sandy's boat was too heavy to tow with her compact car so she decided to use her bicycle to tow it.","sent_2":"Sandy's boat was too heavy to tow with her compact car so she decided to use her pickup truck to tow it.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Since it was snowing I put my coat on to go outside.","sent_2":"Since it was snowing I put my coat on to go inside.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you want to bring in the outside air you should put your fan in the window.","sent_2":"If you want to bring in the outside air you should put your fan in the closet.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you want vegetables to be smaller, then chop them up. ","sent_2":"If you want vegetables to be larger, then chop them up. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Carol makes sure to never leave her toddler in her car when she goes in to the grocery store during summer months.","sent_2":"Carol makes sure to crack the windows when she leaves her toddler in her car when she goes in to the grocery store during summer months. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If Anne's outgrown her ballet slippers, she should buy at least a half size up from her current size.","sent_2":"If Anne's outgrown her ballet slippers, she should buy at least a half size down from her current size.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"The cat drank water from the detached hose.","sent_2":"The cat drank water from the running hose.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Fall was coming up so Jim thought it would be good to buy some sandals.","sent_2":"Spring was coming up so Jim thought it would be good to buy some sandals.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"While I have seasick, I feel better by eating sour food.","sent_2":"While I have seasick, I feel better by eating salty food.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Amy needed some grocery, she ordered online from nearest grocery store.","sent_2":"Amy needed some grocery, she ordered online from nearest pharmacy.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"When someone runs out in front of your car, you should put your foot on the brake.","sent_2":"When someone runs out in front of your car, you should put your foot on the accelerator.  ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"It is a hot day, so Fenton grabbed a big, red popsicle.  If Fenton doesn't want to stain the floor, he should stand in the room with the linoleum floor.","sent_2":"It is a hot day, so Fenton grabbed a big, red popsicle.  If Fenton doesn't want to stain the floor, he should stand in the room with the carpeted floor.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Amy's skin was dry during the Winter so she decided to put some lotion on.","sent_2":"Amy's skin was dry during the Winter so she decided to put some sunscreen on.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"A buffalo does not need to drink water in order to survive","sent_2":"A buffalo does need to drink water in order to survive","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If you beat a campfire with a spoon, you will put it out.","sent_2":"If you beat a campfire with a spoon, you won't put it out.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"Gabriel forgot his sleeping bag for the camping trip, so he can sleep in the car. ","sent_2":"Gabriel forgot his sleeping bag for the camping trip, so he can sleep by the river. ","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"The sea levels would rise if all the glaciers melted instantly.","sent_2":"The sea levels would drop if all the glaciers melted slowly.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If your computer freezes, hitting it as hard as you can will help fix it.","sent_2":"If your computer freezes, hitting it as hard as you can will not help fix it.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If the car is going fast enough before crashing, the crash test dummy will penetrate the windshield.","sent_2":"If the car is going slowly before crashing, the crash test dummy will penetrate the windshield.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"She wanted to write her name in sand but she didn't have a stick, so she used her foot instead.","sent_2":"She wanted to write her name in sand but she didn't have a stick, so she used her eyelashes instead.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If clock on the wall stops working, I can get the time from my watch.","sent_2":"If the clock on the wall stops working, I can get the time from my chair.","label_1":"True","label_2":"False","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"If there is a hurricane in your area, it is safe to walk around outside.","sent_2":"If there is a hurricane in your area, it is not safe to walk around outside.","label_1":"False","label_2":"True","domain":"physical","scenario":"causal","numeracy":"False"},{"sent_1":"You can lift a barrel with four helium balloons attached to it much easier than you can lift a barrel with three hundred helium balloons attached to it.","sent_2":"You can lift a barrel with three hundred helium balloons attached to it much easier than you can lift a barrel with four helium balloons attached to it.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"Squeezing one hundred oranges would give you a lot more juice than squeezing ten oranges would","sent_2":"Squeezing ten oranges would give you a lot more juice than squeezing one hundred oranges would","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is much more difficult to lift a mattress above your head than it is to lift two jars of jelly above your head.","sent_2":"It is much more difficult to lift two jars of jelly above your head than it is to lift a mattress above your head.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to jog one mile than to sprint.","sent_2":"It is not easier to jog one mile than to sprint.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"Since there's already a child that weighs 50 pounds on the seesaw, it's safe and fun to have the other person be a child that weighs 60 pounds.","sent_2":"Since there's already a child that weighs 50 pounds on the seesaw, it's safe and fun to have the other person be an adult that weighs 160 pounds.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to carry the box that has handles than the one that is smooth.","sent_2":"It is harder to carry the box that has handles than the one that is smooth.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is more likely to draw attention if you hang one hundred balloons instead of one.","sent_2":"It is less likely to draw attention if you hang one hundred balloons instead of one.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"Laura is allergic to flowers, so she would probably prefer a bouquet of twelve roses instead of a box of twelve chocolates. ","sent_2":"Laura is allergic to flowers, so she would probably prefer a box of twelve chocolates instead of a bouquet of twelve roses. ","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"A five year old will have an easier time uncapping a plastic bottle than a glass bottle.","sent_2":"A five year old will have an easier time uncapping a glass bottle than a plastic bottle.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is more efficient to carry a bucket of sand as opposed to carrying one grain of sand at a time.","sent_2":"It is more effecient to carry one grain of sand at a time as opposed to carrying a bucket of sand.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"A one pound painting requires more nails to hang than a twenty pound painting.","sent_2":"A twenty pound painting requires more nails to hang than a one pound painting.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"One is more likely to use the dishwasher for a pan than the washing machine.","sent_2":"One is less likely to use the dishwasher for a pan than the washing machine.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It's harder to bike a 100 mile long dirt road than a two mile long one.","sent_2":"It's easier to bike a 100 mile long dirt road than a two mile long one.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"You would wear shorts and a t-shirt when it is 20 degrees Celsius rather than 45 degrees Fahrenheit.","sent_2":"You would wear shorts and a t-shirt when it is 45 degrees Fahrenheit rather than 20 degrees Celsius.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to walk 20 feet than to walk 20 miles.","sent_2":"It is harder to walk 20 feet than to walk 20 miles.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"If you want a clock that is easy to read, buy a digital clock rather than an analog one.","sent_2":"If you want a clock that is easy to read, buy a analog clock rather than a digital one.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"Thin ice is more likely to break if there are two people on it rather than a group of people.","sent_2":"Thin ice is more likely to break if there is a group of people on it rather than two people.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"When you sort thousand books, it would be easier to sort them alphabetically rather than by their quality.","sent_2":"When you sort thousand books, it would be harder to sort them alphabetically rather than by their quality.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"You can more efficiently get on your roof with a thirty foot ladder than you can with a three foot ladder.","sent_2":"You can more efficiently get on your roof with a three foot ladder than you can with a thirty foot ladder.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"Joe wants to take his date on a picnic in the park.  Joe is more likely to go on the date when there is a 20% chance of rain than a 50% chance of rain.","sent_2":"Joe wants to take his date on a picnic in the park.  Joe is more likely to go on the date when there is a 50% chance of rain than a 20% chance of rain.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to run one mile than ten miles","sent_2":"It is easier to run ten miles than one mile","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"Since three people can fit comfortably on the bench, so can a dating couple.","sent_2":"Since three people can fit comfortably on the bench, so can a basketball team with five players.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"One is more likely to fall asleep after having warm milk than warm coffee.","sent_2":"One is less likely to fall asleep after having warm milk than warm coffee.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"If you want a drink that wakes you up, it's better to look for one with a lot of caffeine rather than protein.","sent_2":"If you want a drink that wakes you up, it's better to look for one with a lot of protein rather than caffeine..","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is more likely to be able to feed with family with four potatoes than one.","sent_2":"It is less likely to be able to feed with family with four potatoes than one.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to run three miles than it is to run ten miles. ","sent_2":"It is easier to run three miles than it is to run one hundred miles. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to climb over a bar that is six feet high than it is to walk under it.","sent_2":"It is easier to walk under a bar that is six feet high than it is to climb over it.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"True"},{"sent_1":"If you don't have a spoon, it's easier to eat cereal with a fork than chopsticks.","sent_2":"If you don't have a spoon, it's easier to eat cereal with chopsticks than a fork.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to cut the meat with a knife than with a straw.","sent_2":"It is easier to cut the meat with a straw than with a knife.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Where there is no power supply, it is easier to read a book during the day than at night.","sent_2":"Where there is no power supply, it is more difficult to read a book during the day than at night.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Onions are easier to chop on a surf board than on an emery board.","sent_2":"Onions are easier to chop on an emery board than on a surf board.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Since dogs can't eat chocolate, katy gave her dog a milk bone instead of a hershey bar.","sent_2":"Since dogs can't eat chocolate, katy gave her dog a hershey bar instead of a milk bone.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A human is taller when measured at the shoulder than giraffe.","sent_2":"A human is shorter when measured at the shoulder than giraffe.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Binoculars work better to see something far away than a magnifying glass","sent_2":"A magnifying glass works better to see something far away than binoculars.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A ping pong ball has a lower chance of bruising your arm than a rock.","sent_2":"A ping pong ball has a higher chance of bruising your arm than a rock.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to close a crab's claw with a rubber band than it is with a newspaper.","sent_2":"It is easier to close a crab's claw with a newspaper than it is with a rubber band.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A green snake will be better hidden under vegetation than on a bare field.","sent_2":"A green snake will be better hidden on a bare field than under vegetation.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to sit while you eat your hot soup that it is to stand.","sent_2":"It is easier to stand while you eat your hot soup that it is to sit.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If you need to get somewhere quickly, it's more acceptable to ride a bike than a tricycle.","sent_2":"If you need to get somewhere quickly, it's more acceptable to ride a tricycle than a bike.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"You can insert your foot into a cowboy boot easier than a slipper.","sent_2":"You can insert your foot into a slipper easier than a cowboy boot.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If Sonja broke her bike, it would be better to run to school than ride a horse.","sent_2":"If Sonja broke her bike, it would be better to ride a horse than run to school.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is more practical to use a towel as a yoga mat instead of a blanket. ","sent_2":"It is more practical to use a blanket as a yoga mat instead of a towel. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to use a rubber band for a ponytail than it is to use a paper clip.","sent_2":"It is harder to use a rubber band for a ponytail than it is to use a paper clip.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If I want to weigh down some papers, it is much better to use an empty plastic bag than a baseball.","sent_2":"If I want to weigh down some papers, it is much better to use a baseball than an empty plastic bag.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to shine your shoes with a cloth than a tissue.","sent_2":"It is better to shine your shoes with a tissue than a cloth.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Patrick is taller than Jayleen so she calls him when she needs to reach top shelf","sent_2":"Patrick is taller than Jayleen so she calls him when she can't reach bottom shelf","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's faster to drive to the store instead of run. ","sent_2":"It's faster to run to the store instead of drive a car. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If I don't have a blanket to keep warm, it's better to use a rug as a substitute than a shower curtain.","sent_2":"If I don't have a blanket to keep warm, it's better to use a shower curtain as a substitute than a rug.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's much more challenging to try to bathe an elephant than a dog in your bathtub.","sent_2":"It's much more challenging to try to bathe a dog than an elephant in your bathtub.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to eat jello with a spoon instead of a fork. ","sent_2":"It is easier to eat jello with a fork instead of a spoon.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If he doesn't have electricity, he is more likely to buy a television than a book.","sent_2":"If he doesn't have electricity, he is more likely to buy a book than a television.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to tie back the curtains with a scarf than a blanket. ","sent_2":"It is better to tie back the curtains with a blanket than a scarf. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's less frustrating to split wood with a long axe than with a short axe.","sent_2":"It's more frustrating to split wood with a long axe than with a short axe.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's better to wear a sock on your head than on your foot","sent_2":"It's better to wear a sock on your foot than on your head.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If I am starting a compost pile, it is more effective to use a pile of limes than it is to use a basketball.","sent_2":"If I am starting a compost pile, it is more effective to use a basketball than it is to use a pile of limes.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Pouring water on a campfire is more likely to put the campfire out than pouring gasoline on a campfire.","sent_2":"Pouring gasoline on a campfire is more likely to put the campfire out than pouring water on a campfire.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is more sanitary to clean out a wound with alcohol than vinegar.","sent_2":"It is less sanitary to clean out a wound with alcohol than vinegar.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":" Phillips is terrified of heights. He would prefer racing to skydiving.","sent_2":"Phillips is terrified of heights. He would prefer skydiving to racing.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is more helpful to leave a candle burning than a match for light if your power goes out.","sent_2":"It is more helpful to leave a match burning than a candle for light if your power goes out.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"When you need to open a taped box, it would be more useful to use an ice pick than a spatula.","sent_2":"When you need to open a taped box, it would be more useful to use a spatula than an ice pick.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A bowling ball is more difficult to lift than an empty water bottle is.","sent_2":"An empty water bottle is more difficult to lift than a bowling ball is.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to swallow a whole watermelon than a grape.","sent_2":"It is easier to swallow a whole grape than a watermelon.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"The 600-pound sumo wrestler will probably knock the 300-pound wrestler out of the ring.","sent_2":"The 300-pound sumo wrestler will probably knock the 600-pound wrestler out of the ring.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Since you want to lose weight, it's a better idea to snack on apple sauce instead of fries.","sent_2":"Since you want to gain weight, it's a better idea to snack on apple sauce instead of fries.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is more convenient to eat linguine with a fork than a spoon.","sent_2":"It is more convenient to eat linguine with a spoon than a fork.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A spoon might be more suitable for eating soup than a fork.","sent_2":"A spoon might be less suitable for eating soup than a fork.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Your hands would be better protected from cactus spines if you wore rubber gloves instead of leather gloves.","sent_2":"Your hands would be better protected from cactus spines if you wore leather gloves instead of rubber gloves.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A dump truck would be a wiser choice of vehicle to haul debris from a construction site than a minivan.","sent_2":"A minivan would be a wiser choice of vehicle to haul debris from a construction site than a dump truck.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is faster to paint with a roller than a paintbrush.","sent_2":"It is faster to paint with a paintbrush than a roller.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's easier to get a haircut with a straight razor than with scissors.","sent_2":"It's easier to get a haircut with scissors than with a straight razor.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A steel pipe works better as a hammer than a paper towel","sent_2":"A steel pipe is better to wipe up a spill than a paper towel ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to wake someone up an hour before schedule than to allow them to wake up to their alarm.","sent_2":"It is better to allow someone to wake up to their alarm than it is to wake them up an hour before schedule.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to use a mouse as a paperweight than a bouquet of flowers.","sent_2":"It is better to use a bouquet of flowers than a mouse as a paperweight.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"an aluminum cooking pot is more suitable to boil eggs than a flat non stick pan. ","sent_2":"an aluminum cooking pot is less suitable to boil eggs than a flat non stick pan. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A guard dog is a better option then a guard cat to keep your house safe.","sent_2":"A guard dog will not keep your house as safe as a guard cat would.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"To encourage her father to get more exercise, Joanna got him a dog instead of a cat.","sent_2":"To encourage her father to get more exercise, Joanna got him a cat instead of a dog.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"When cleaning a TV screen, it's better to use a microfiber cloth than to use a wool sweater.","sent_2":"When cleaning a TV screen, it's better to use a wool sweater than to use a microfiber cloth..","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's faster to get where you're going in a car rather than walking.","sent_2":"It's slower to get where you're going in a car rather than walking.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A steel nail is more suitable to draw on a cement wall than a knife.","sent_2":"A steel nail is less suitable to draw on a cement wall than a knife.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to open a locked car door with a human hand than it is to open a book with a human hand.","sent_2":"It is harder to open a locked car door with a human hand than it is to open a book with a human hand.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It would be easier to tame a feral cat than catch a wolf.","sent_2":"It would be harder to tame a feral cat than catch a wolf.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Both road bikes and mountain bikes can be ridden on roads, but the mountain bikes' tires are more likely to pop.","sent_2":"Both road bikes and mountain bikes can be ridden on roads, but the road bikes are more likely to set speed records.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's more convenient to use a sponge than a brush when washing your car.","sent_2":"It's less convenient to use a sponge than a brush when washing your car.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"When cleaning up spilled water, it is better to use a cloth than a brush.","sent_2":"When cleaning up spilled water, it is better to use a brush than a cloth.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Individual eggs weigh more than a ball of lead the same size.","sent_2":"Individual eggs weigh less than a ball of lead the same size.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A hot sauce is going to be hotter if it uses habanero peppers rather than jalapeno.","sent_2":"A hot sauce is going to be hotter if it uses jalapeno peppers rather than habanero.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If you do not have dumbbells, it makes sense to use a cement block for strength training rather than a pillow.","sent_2":"If you do not have dumbbells, it makes sense to use a pillow for strength training rather than a cement block.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Since there is a storm watch, it's best to stay inside rather than go out to the bar.","sent_2":"Since there is a storm watch, it's best to go out to the bar rather than stay inside.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to jump over the couch than over the bed. ","sent_2":"It is easier to jump over the bed than over the couch. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"To improve the look of a couch, people prefer to use pillows rather than paintings.","sent_2":"To improve the look of a couch, people prefer to use paintings rather than pillows.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Bob watches TV all day while his wife exercises. His wife would win in a race.","sent_2":"Bob watches TV all day while his wife exercises. His wife would lose in a race.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is best to put a fire out with water instead of milk.","sent_2":"It is best to put a fire out with milk instead of water.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"In the event that you forget to bring a pen to complete the essay on the exam, it is advisable to use a sharpie rather than a pencil. ","sent_2":"In the event that you do forget to bring a pen to complete the essay on the exam , it is advisable to use a pencil rather than a highlighter. ","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"The skier who went to the top of the steepest slope reached the bottom of the mountain sooner than the skier who went to the top of the shallow slope.","sent_2":"The skier who went to the top of the shallow slope reached the bottom of the mountain sooner than the skier who went to the top of the steepest slope.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"You can hang a poster on a door much easier than you can hang it on a bear.","sent_2":"You can hang a poster on a bear much easier than you can hang it on a door.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Lifting a refrigerator up to a window using a pulley is easier if you have very little body weight.","sent_2":"Lifting a refrigerator up to a window using a pulley is easier if you have a lot of body weight.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to drink water than mojitos when you are hiking.","sent_2":"It is better to drink water than mojitos when you are at a party.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's more comfortable to sit on a carpet floor rather than a tile floor.","sent_2":"It's more comfortable to sit on a tile floor rather than a carpet floor.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"At a picnic, it would be better to use a bed sheet than shredded paper for picnic cloth.","sent_2":"At a picnic, it would be better to use shredded paper than a bed sheet for picnic cloth.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A very tall person would need a longer skipping rope than a short person would need","sent_2":"A very tall person would need a shorter skipping rope than a short person would need","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"You can hear music better if you put the end of the headphones with the earbuds into your ears instead of the end with the headphone jack.","sent_2":"You can hear music better if you put the end of the headphones with the headphone jack into your ears instead of the end with the earbuds.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It was January in New York so Pat knew that he would see more people in the gym rather than at the park.","sent_2":"It was January in New York so Pat knew that he would see more people at the park rather than in the gym.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A brick makes for a better door stop than a soda bottle.","sent_2":"A brick makes for a better container than a soda bottle.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is faster to travel by bicycle than by motorcycle","sent_2":"It is faster to travel by motorcycle than by bicycle.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's better to sharpen dull knives on leather than wool.","sent_2":"It's better to sharpen dull knives on wool than leather.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"When I haven't slept enough, I think that coffee is a better ally to keep me awake compared to chamomile tea.","sent_2":"When I haven't slept enough, I think that chamomile tea is a better ally to keep me awake compared to coffee.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to swallow orange juice than an orange fruit","sent_2":"It is easier to swallow an orange fruit than orange juice","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Jumping into a pile of leaves is softer than jumping into a pile of sticks.","sent_2":"Jumping into a pile of leaves is harder than jumping into a pile of sticks.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"There is more parking available for cars than bikes at a local park.","sent_2":"There is more parking available for bikes than cars at a local park.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is more suitable to store a sample of soil in tupperware than in a wine bottle.","sent_2":"It is more suitable to store a sample of liquor in tupperware than in a wine bottle.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If my door won't stay shut, if I put my couch in front of it, it'll be more likely to stay closed than if I put my coffee cup in front of it.","sent_2":"If my door won't stay shut, if I put my coffee cup in front of it, it'll be more likely to stay closed than if I put my couch in front of it.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to use a spoon to eat soup with than a fork.","sent_2":"It is better to use a fork to eat soup with than a spoon.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"it is easier to use a fork to beat an egg than a spoon","sent_2":"it is easier to beat an egg using a spoon rather than a fork","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is better to eat soup with a serving spoon than a small spoon.","sent_2":"It is better to eat soup with a small spoon than a serving spoon.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"She ran out of sunscreen so it's better to bring a an umbrella to the beach than sunglasses.","sent_2":"She ran out of sunscreen so it's better to bring a an sunglasses to the beach than umbrella.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's more convenient for Jane to use a car to go to school which is next door to her house than to walk.","sent_2":"It's less convenient for Jane to use a car to go to school which is next door to her house than to walk.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Sugar and salt look the same, but I'd only use salt on my spaghetti.","sent_2":"Sugar and salt look the same, but I'd only use sugar on my spaghetti.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"A chainsaw is better suited to cutting down a tree than a pickaxe.","sent_2":"A pickaxe is better suited to cutting down a tree than a chainsaw.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"To condition a baseball glove, it's better to use special oil than mayonnaise.","sent_2":"To condition a baseball glove, it's better to use mayonnaise than special oil.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If it's hot inside you should turn on a fan and not a heater.","sent_2":"If it's hot inside you should turn on a heater and not a fan.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It's faster to clean up cat litter with a vacuum instead of a mop.","sent_2":"It's faster to clean up cat litter with a mop instead of a vacuum.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Since Tim is allergic to wheat, he ate eggs instead of cereal.","sent_2":"Since Tim is allergic to wheat, he ate cereal instead of eggs.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If you don't have a screwdriver, it might be easier to use a butter knife to drive screws than a plastic bag.","sent_2":"If you don't have a screwdriver, it might be easier to use a plastic bag to drive screws than a butter knife.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Jennifer wants to stay as hygienic as possible, so she takes showers instead of baths.","sent_2":"Jennifer wants to stay as hygienic as possible, so she takes baths instead of showers.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It usually takes more yarn to knit a blanket than a dishtowel.","sent_2":"It usually takes less yarn to knit a blanket than a dishtowel.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Karen is worried about wine getting spilled at her house party, so she chooses to use the white rugs instead of the purple ones.","sent_2":"Karen is worried about wine getting spilled at her house party, so she chooses to use the purple rugs instead of the white ones.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Hitting someone in the face with a pillow would be a lot  than less painful hitting someone in the face with a hammer","sent_2":"Hitting someone in the face with a hammer would be a lot less painful than hitting someone in the face with a pillow","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"It is easier to open a door with a key than with a hammer.","sent_2":"It is easier to open a door with a hammer than with a key.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"UV rays from the sun are more harmful than a tanning bed.","sent_2":"A tanning bed is more harmful than UV rays from the sun.","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Since Katie's shoulders are sunburnt, she wore a shirt instead of a bikini.","sent_2":"Since Katie's shoulders are sunburnt, she wore a bikini instead of a shirt.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Swimming with sharks is a lot safer outside of a cage","sent_2":"Swimming with sharks is a lot safer inside of a cage","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"When it's snowing, it's better to wear a sweatshirt rather than a tank top so your clothes don't get wet.","sent_2":"When it's snowing, it's better to wear a tank top rather than a sweatshirt so your clothes don't get wet.","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"If I am removing a pipe from under the sink, I would rather place a colander under it instead of a bucket. ","sent_2":"If I am removing a pipe from under the sink, I would rather place a bucket under it instead of a colander. ","label_1":"False","label_2":"True","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"I ripped a hole in the knee of my jeans, so I should repair it with a patch instead of with rubber cement. ","sent_2":"I ripped a hole in the knee of my jeans, so I should repair it with rubber cement instead of with a patch.. ","label_1":"True","label_2":"False","domain":"physical","scenario":"comparison","numeracy":"False"},{"sent_1":"Kim, a waitress, would likely be thrilled to receive a one dollar tip from her customer.","sent_2":"Kim, a waitress, would likely be thrilled to receive a one-hundred dollar tip from her customer.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"One man can untie a knot in three minutes; ten men will need at least thirty minutes to untie ten such knots.","sent_2":"One man can untie a knot in three minutes; ten men will need at least three minutes to untie ten such knots.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Doctor recommended Edward to run at least one mile a week so Edward spent five minutes running everyday at 20 mph","sent_2":"Doctor recommended Edward to run at least one mile a week so Edward spent five minutes running everyday at 1 mph","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"The new zoo opened with 20 cheetahs, but the people there didn't think this was too many.","sent_2":"The new zoo opened with 4 cheetah pairs, but the people there didn't think this was too many.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Sally wants to loose weight to fit in her old dress so she will diet to loose one pound.","sent_2":"Sally wants to loose weight to fit in her old dress so she will diet to loose ten pounds.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Bill is obese and would love to lose some pounds, so he would feel content to lose fifty pounds over six months.","sent_2":"Bill is obese and would love to lose some pounds, so he would feel content to lose two pounds over six months.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Tim works 80 hours per week, so he is able to hang out with his friends very often.","sent_2":"Tim works 80 hours per week, so he is not able to hang out with his friends very often.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"The six cheerleaders formed a perfect pyramid.","sent_2":"The four cheerleaders formed a perfect pyramid.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"I made a quick stop for gas to fill up my mostly full truck and paid 10 dollars for it.","sent_2":"I made a quick stop for gas to fill up my mostly empty truck and paid 10 dollars for it.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"When Beth thought everyone forgot her birthday, she was so excited to see fifty of her friends show up to her surprise party.","sent_2":"When Beth thought everyone forgot her birthday, she was so saddened to see fifty of her friends show up to her surprise party.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Tim wants to marry one of his students, Mary, but it might upset his family.","sent_2":"Tim wants to marry one of his students, Mary, it might make his family happy.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Tammy likes walking in the hot weather so she chose to walk when it was 90 degrees.","sent_2":"Tammy likes walking in the snowy weather so she chose to walk when it was 90 degrees.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Rose cooking for 50 people, Because her 5 friends coming to visit her","sent_2":"Rose cooking for 50 people, Because her 50 friends coming to visit her","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"The ten-to-one ratio of teachers to students was ideal.","sent_2":"The ten-to-one ratio of students to teachers was ideal.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"With a family income of more than one hundred thousand dollars, they can afford a modest home in a middle class neighborhood.","sent_2":"With a family income of more than one hundred thousand dollars, they cannot afford a modest home in a middle class neighborhood.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Clarissa just bought a two thousand dollar laptop on credit, so she will not want to buy a designer handbag. ","sent_2":"Clarissa just bought a two thousand dollar laptop on credit, so she will also want to buy a designer handbag. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"People were happy to see the local basketball star David score 30 points in the game.","sent_2":"People were bored to see the local basketball star David score 30 points in the game.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Having only ran a maximum of one hundred meters before, he was apprehensive about running a kilometer.","sent_2":"Having only ran a maximum of one hundred meters before, he was confident about running a kilometer.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Since she needs one bottle of soda Sally can carry it home.","sent_2":"Since she needs one case of soda Sally can carry it home.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Danny served three years in prison for carjacking. His neighbors would probably entrust Danny with their cash.","sent_2":"Danny served three years in prison for carjacking. His neighbors would probably not entrust Danny with their cash.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Frank saved up one hundred dollars, he can afford a new car.","sent_2":"Frank saved up one hundred dollars, he can't afford a new car","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Jim is planning on buying a car for his eighteen-year-old daughter as a graduation present.","sent_2":"Jim is planning on buying a car for his twelve-year-old daughter as a graduation present.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"If two people are walking down the street holding hands, they know each other.","sent_2":"If two people are walking down the street holding hands, they don't know each other.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Sam's stocks have increased 13% in 2 years so Sam was not happy.","sent_2":"Sam's stocks have increased 13% in 2 days so Sam was not happy.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"When a 20 year old comes to my door at Halloween I kind of wonder","sent_2":"When a 6 year old comes to my door at Halloween I kind of wonder","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"Jimmy was excited that he was almost finished reading the novel. He had less than 10 pages left to read.","sent_2":"Jimmy was excited that he was almost finished reading the novel. He had about 500 pages left to read.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"I he had fifty dollars to spend, he probably was able to afford to buy a t-shirt.","sent_2":"I he had fifty dollars to spend, he probably was able to afford to buy a boat.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"True"},{"sent_1":"During a hiking trip, I tried to stay behind my instructor because they knew the path.","sent_2":"During a hiking trip, I tried to stay ahead of my instructor because they knew the path.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Timmy gets offended easily, is quick to anger, and often insults people for no particular reason, so he makes new friends quickly.","sent_2":"Timmy gets offended easily, is quick to anger, and often insults people for no particular reason, so he makes new friends slowly.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Mark gets pulled over for speeding on his way to the hospital.  The officer may not ticket him if Mark explains that his wife is in Labor.","sent_2":"Mark gets pulled over for speeding on his way to the hospital.  The officer may not ticket him if Mark explains that he is taking lunch to a friend.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Given his increase in business it would be a good time to get a car loan.","sent_2":"Given his decrease in business it would be a bad time to get a car loan.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tim's parents are in financial trouble and don't provide him with much food, so Tim appreciates the free meal he gets from school.","sent_2":"Tim's parents are rich and he eats 5 star meals everyday, so Tim appreciates the free meal he gets from school.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Before stepping out, Jack has to check if he has mask because they are mandatory in most places","sent_2":"Before stepping out, Jack has to check if he left mask at home because they are not in trend and he doesn't want to wear it","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Joan secretly admired Peter. She was disappointed to find out he has a girlfriend.","sent_2":"Joan secretly admired Peter. She was delighted to find out he has a girlfriend.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Mike rejected the Ben's Job offer, Because he is jobless","sent_2":"Mike accepted the Ben's Job offer, Because he is jobless","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Ryan buying his son alcohol for his seventh birthday is legal.","sent_2":"Ryan buying his son alcohol for his twenty-first birthday is legal.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Alex has a social anxiety disorder so he enjoys staying home on weekends.","sent_2":"Alex has a social anxiety disorder so he enjoys partying on weekends.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"I want to start paying off all of my credit cards, so I should first pay off the credit card with the highest interest rate at 20%.","sent_2":"I want to start paying off all of my credit cards, so I should first pay off the credit card with the lowest interest rate at 0%.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If someone throws a ball to another person, the other person should try and catch the ball.","sent_2":"If someone throws a ball to another person, the other person should try and drop the ball.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If Edie gets mad when she loses at a game her friends will not want to play games with her again.","sent_2":"If Edie doesn't get mad when she loses at a game her friends will not want to play games with her again.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Billy works at cubicle in an office, while Joey works as a mason, so Joey will be more physically exhausted at the end of his workday than Billy.","sent_2":"Billy works at cubicle in an office, while Joey works as a mason, so Joey will be more physically exhausted at the end of his workday than Billy.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jill has read all the books on fixing bikes so Jane is likely to bring a broken bike to her. ","sent_2":"Jill has read all the books on fixing bikes so Jane is unlikely to bring a broken bike to her. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If you are in charge of taking care of a park and want to keep it clean, you should make sure it has dozens of garbage cans.","sent_2":"If you are in charge of taking care of a park and want to keep it clean, you should make sure it has two garbage cans.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Anushka borrowed money from her friend last month, she returned the money after adding interest to the amount.","sent_2":"Anushka borrowed money from her friend last month, she returned the money after deducting interest from the amount.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"People would admire you if you live off of your elderly mom.","sent_2":"People would not respect you if you live off of your elderly mom.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Sam plays the piano. He was confused when his best friend gave him a new violin for his birthday.","sent_2":"Sam plays the piano. He was exhilarated when his best friend gave him a new violin for his birthday.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"James was viewed as weird because he put water in his cereal.","sent_2":"James was viewed as weird because he put milk in his cereal.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"When the commercials start I can go get a snack.","sent_2":"When the commercials start I can not go get a snack.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tim wanted to learn how to shoot a basketball so he looked up videos of Steph Curry.","sent_2":"Tim wanted to learn how to shoot a basketball so he looked up videos of Tom Brady.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"The college coach had been paying his players so he was praised by the media.","sent_2":"The college coach had been paying his players so he was criticized by the media.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If you give your deaf friend Mariah Carey's Greatest Hits album as a gift, he or she will not find it considerate and thoughtful.","sent_2":"If you give your deaf friend Mariah Carey's Greatest Hits album as a gift, he or she will find it considerate and thoughtful.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Nate hates Chelsea, so he will take great pleasure in taking her spot on the debate team.","sent_2":"Nate hates Chelsea, so he will not take great pleasure in taking her spot on the debate team.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Since Rebecka was trying to learn French, she spend an hour each day practicing.","sent_2":"Since Rebecka was trying to learn French, she spend thirty seconds each day practicing.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If you see a man passed out in the street, you should take stuff from his pocket.","sent_2":"If you see a man passed out in the street, you should not take stuff from his pocket.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"I had to leave quickly while robbing that home because the owner came home early.","sent_2":"I had plenty of time to rob that home when the owner suddenly came home early.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Diane feels unsafe in her new apartment, so she buys a small dog to guard her house.","sent_2":"Diane feels unsafe in her new apartment, so she buys a big dog to guard her house.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As he worked very hard during his younger years, he became rich but his health had deteriorated.","sent_2":"As he worked very hard during his younger years, he became poor but his health had improved.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"When it is raining outside there are less people walking their dogs.","sent_2":"When it is raining outside there are more people walking their dogs.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Anne is getting old, so she gets tired more easily at work","sent_2":"Anne is getting old, so she gets tired less easily at work ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If you use records for your music collection, you will save a lot of storage space in your home.","sent_2":"If you use digital for your music collection, you will save a lot of storage space in your home.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tim didn't want any noise bothering him so he put on some headphones.","sent_2":"Tim didn't want any noise bothering him so he put on some AirPods.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tom got bored and decided to go on a vacation to Mexico","sent_2":"Tom got assaulted and decided to go on a vacation to Mexico","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Peter's daughters is going to marry next week, he booked a wedding hall for that purpose.","sent_2":"Peter's daughters is going to marry next week, he booked a cemetary for that purpose.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"James decided to let Cynthia know she looked wide in her outfit","sent_2":"James decided to let Cynthia know she looked narrow in her outfit","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jason, who has 100 friends, had an easy time finding a ride home from the party.","sent_2":"Jason, who has no friends, had an easy time finding a ride home from the party.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jennifer is very tall, so she has trouble finding a suitable romantic partner. ","sent_2":"Jennifer is very tall, so she has no issue finding a suitable romantic partner. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As the weather was very cold he put on his jacket to protect himself.","sent_2":"As the weather was very hot he put on his jacket to protect himself.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"The girl had been busy preparing the meal all day long and was disappointed when her date brought pizza to eat.","sent_2":"The girl had been busy preparing the meal all day long and was excited when her date brought pizza to eat. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Paula has a final exam next week. Paula decided to go to a party with her friends.","sent_2":"Paula has a birthday next week. Paula decided to go to a party with her friends.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Alex  said to Professor ,\"Sir, I love you, you love your daughter, so I indirectly love your daughter.","sent_2":"Alex  said to Professor ,\"Sir, I love you, you love your daughter, so I directly love your daughter.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Phil was in a hurry to get to work but he was afraid of another speeding ticket so he drove safely.","sent_2":"Phil was in a hurry to get to work but he was afraid of another speeding ticket so he drove dangerously.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"A person who operates a motor vehicle while intoxicated is considered irresponsible.","sent_2":"A person who operates a motor vehicle while intoxicated is considered responsible.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"They were dating for a while, so he gave her an expensive gift.","sent_2":"They were dating for a while, so he introduced himself.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jerry invited me to his wedding ceremony, I went there with bunch of flowers and wearing my best suit.","sent_2":"Jerry invited me to his wedding ceremony, I went there with bunch of cactus and wearing nothing but underpants.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If I borrow a book from a friend and don't return it, she will be unlikely to lend me anything again.","sent_2":"If I borrow a book from a friend and return it, she will unlikely to lend me anything again.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"The number of biological children a 50-year-old woman has is very unlikely to increase.","sent_2":"The number of foster children a 50-year-old woman has is very unlikely to increase.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Anne had a small apartment so it would be ok if everyone had to stay for a few days.","sent_2":"Anne had a small apartment so it would not be ok if everyone had to stay for a few days.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Once a child has teeth, they will eat tougher foods.","sent_2":"Once a child has teeth, they will eat softer foods.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Technology from the 18th century was more convenient that what we have today, so it is undesirable to travel back in time.","sent_2":"Technology from the 18th century was less convenient that what we have today, so it is undesirable to travel back in time.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Ren had a hard time trying to work up the courage to ask the girl out because she was popular in school.","sent_2":"Ren had a hard time trying to work up the courage to ask the girl out because she was unpopular in school.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Everyone looked at Kevin in disgust because he slammed the weights on the floor in the gym.","sent_2":"Everyone looked at Kevin in awe because he slammed the weights on the floor in the gym.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tom wanted his hair to stand up straight so he put hair spray in it.","sent_2":"Tom wanted his hair to stand up straight so he put mousse in it.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"A federal prison is being built near a residential area. More families would move away from the area.","sent_2":"A federal prison is being built near a residential area. More families would migrate to the area.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Peter enjoys speed so he is likely to drive mostly in the fast lane on highways.","sent_2":"Peter enjoys speed so he is unlikely to drive mostly in the fast lane on highways.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Nora was distrusting of her friends, so she followed them around and recorded what they did.","sent_2":"Nora was trusting of her friends, so she followed them around and recorded what they did.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tom has prostate problems so he prefers to sit near the aisle during a long flight.","sent_2":"Tom has prostate problems so he prefers to sit near the window during a long flight.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Because of the current pandemic, James often goes over to his friend's house.","sent_2":"Because of the current pandemic, James refuses to go over to his friend's house.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Ron wanted more consistent income so he bought an apartment complex.","sent_2":"Ron wanted more consistent income so he bought a stock.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If Marcia is planning to buy a horse, she will need to save several hundred dollars.","sent_2":"If Marcia is planning to buy a horse, she will need to save several dollars.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As children are out of school in the summer drivers need to be careful and watch for children in the street.","sent_2":"As children are out of school in the summer drivers do not need to be careful and watch for children in the street.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"The pandemic has made people very afraid to do normal things. ","sent_2":"The pandemic has made people not afraid to do normal things. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"My Friend was severely ill and was admitted in a hospital, I carried flowers and fruits when visited.","sent_2":"My Friend was severely ill and was admitted in a hospital, I carried condoms and sex toys when visited.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jack was glad to finally be able to take his son to the bar for his twenty-first birthday.","sent_2":"Jack was glad to finally be able to take his son to the bar for his seventeenth birthday.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jenny organized a car wash that raised $800 for her school's drama club. Her teacher was proud of her.","sent_2":"Jenny organized a car wash that didn't raise any money for her school's drama club. Her teacher was proud of her.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"With her friend on fire Cynthia decided to panic","sent_2":"With her friend on fire Cynthia decided to not panic","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Children are taught to look both ways before crossing a dangerous street.","sent_2":"Children are taught to look both ways before crossing a dangerous river.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tom put's the baby in the child's seat and drives to the store. ","sent_2":"The baby is in the driver's seat and drives Tom to the store. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As he wanted to ensure that he can meet his expenses after retirement smoothly, he saved money regularly. ","sent_2":"As he wanted to ensure that he can meet his expenses after retirement smoothly, he spent money lavishly.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Carol will participate in a beauty contest to be held soon so she decides to eat less.","sent_2":"Carol will participate in a beauty contest to be held soon so she decides to eat more.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Kelly always loved science class. Since she mostly got 80’s and 90’s on her tests, she frequently made the honor roll. ","sent_2":"Kelly always loved science class. Since she mostly got 50’s and 60’s on her tests, she frequently made the honor roll. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If you are cook, it is important to make sure to note the price of the item","sent_2":"If you are cook, it is important to make sure to note the expiry date of the item","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Adults were not allowed to see the show, so 35-year-old Matt, who was looking forward to it, was quite disappointed.","sent_2":"Adults were not allowed to see the show, so 15-year-old Matt, who was looking forward to it, was quite disappointed.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"John wanted to becomea scientist as hewas very good in science.","sent_2":"John wanted to becomea scientist as hewas very poor in science.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Because John has no license to drive a car, The police office leave him with warning","sent_2":"Because John has no license to drive a car, The police office fined him with warning","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If Mary does a bad job at cutting my hair, I will be unlikely to make a return appointment.","sent_2":"If Mary does a bad job at cutting my hair, I will be likely to make a return appointment.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tim was sick so he used hand sanitizer to make it less likely that he would spread his germs.","sent_2":"Tim was sick so he used disinfectants to make it less likely that he would spread his germs.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As more autistic kids enter the room while the normal kids are leaving, it becomes quieter.","sent_2":"As more autistic kids enter the room while the normal kids are leaving, it becomes louder.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"This little league game broke out in a absolute players brawl after a bad call","sent_2":"This pro league game broke out in a absolute players brawl after a bad call","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jack is willing to let the customer standing behind him go first to the cashier as she is pregnant.","sent_2":"Jack prefers not to let the customer standing behind him go first to the cashier as she is pregnant.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As Harry got injured he rushed to the hospital for help","sent_2":"As Harry got engaged he rushed to the hospital for help","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Learning Japanese is more difficult than learning Italian","sent_2":"Learning Italian is more difficult than learning Japanese","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"The crowd was large, so it was hard to get the moderator's attention.","sent_2":"The crowd was large, so it was easy to get the moderator's attention.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Toilet paper becomes more expensive when there is a pandemic.","sent_2":"Toilet paper goes on sale when there is a pandemic.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"All of Jim's classmates liked him because he beat up the kid in the wheelchair.","sent_2":"None of Jim's classmates liked him because he beat up the kid in the wheelchair.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Jack decided not to join robbery because he doesn't want to get jailed","sent_2":"Jack decided to join robbery because he doesn't want to get jailed","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Alison does not like loud noises.  She is likely to invite all of the children in the neighborhood to play in her house.","sent_2":"Alison does not like loud noises.  She is unlikely to invite all of the children in the neighborhood to play in her house.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Janet went for the pizza grocery shopping today, she bought loads of cheese and sauces.","sent_2":"Janet went for the pizza grocery shopping today, she bought loads of tubes and tires.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"After her husband forgot their wedding anniversary, Suzanne was very pleased that her husband sent her a dozen roses to make up for it. ","sent_2":"After her husband forgot their wedding anniversary, Suzanne was very pleased that her husband did not send her a dozen roses to make up for it. ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"By dedicating time to studying, I'll have better chances to pass the exams and my parents will be proud of me.","sent_2":"By dedicating time to studying, I'll have better chances to pass the exams and my parents will be worried about me.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"As a self-admitted alcoholic and AA member, Tom avoids drinking in all circumstances per AA doctrine.","sent_2":"As a self-admitted alcoholic and AA member, Tom drinks only water and wine per AA doctrine.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"I ran the red light and got a ticket from a police officer.","sent_2":"I ran the red light and got a ticket from a hockey player.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Sonja only has half a liter of wine for dinner. She would be happier if she had a gallon of wine.","sent_2":"Sonja only has a gallon of wine for dinner. She would be happier if she had half a liter of wine.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"If a person hands you a gift, you should open it.","sent_2":"If a person hands you a gift, you should set it down.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Buying the whole family gifts the day before Christmas should give a sufficient amount of time to wrap them all. ","sent_2":"Buying the whole family gifts two weeks before Christmas should give a sufficient amount of time to wrap them all. ","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Some pregnant women have the weirdest eating urges ","sent_2":"Some pregnant men have the weirdest eating urges ","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Sam got food poisoning from eating bad kung pao chicken yesterday. He is likely to go back to Chinese restaurants soon.","sent_2":"Sam got food poisoning from eating bad kung pao chicken yesterday. He is unlikely to go back to Chinese restaurants soon.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Adam invited his girlfriend to meet his parents, she brought her parents along with her..","sent_2":"Adam invited his girlfriend to meet his parents, she brought her neighbors along with her.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Because it was 6pm on Halloween and we had plenty of candy, I decided to open the door and turn the porch light on.","sent_2":"Because it was 6pm on Halloween and we no candy, I decided to open the door and turn the porch light on.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"My son got bad grades, so I decided to try to help him with his homework.","sent_2":"My son got bad grades, so I decided to try to help him with his video games.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Kendra felt nervous because she was about to go into a bar for the first time.","sent_2":"Kendra felt nervous because she was about to go into a bar for the tenth time.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"I was left on the side of the road, so I decided to put up my thumb to try to hitch hike off of someone.","sent_2":"I was left on the side of the road, so I decided to put up my middle finger to try to hitch hike off of someone.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"John called out to his friend but he didn't hear him as he was an arm's length away. ","sent_2":"John called out to his friend but he didn't hear him as he was a mile away. ","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Since the store samples are free, the store owner would not mind if you take entire samples for testing.","sent_2":"Since the store samples are free, the store owner would worry if you take entire samples for testing.","label_1":"False","label_2":"True","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Tom wanted to become a BMX rider so he bought a bike.","sent_2":"Tom wanted to become a BMX rider so he bought a skateboard.","label_1":"True","label_2":"False","domain":"social","scenario":"causal","numeracy":"False"},{"sent_1":"Since Kate was on a budget, she decided to spend $20 per person on Christmas gifts this year instead of her usual $50 per person. ","sent_2":"Since Kate was on a budget, she decided to spend her usual $50 per person on Christmas gifts this year instead of $20 per person. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Since Angela has social anxiety, she opted to go to the coffee shop with only three people present instead of the one with thirty people present. ","sent_2":"Since Angela has social anxiety, she opted to go to the coffee shop with thirty people present instead of the one with only three people present. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Judy and Ruth work in the same hospital, Judy has three young children while Ruth has no child. therefore Ruth is more likely to pick extra shifts.","sent_2":"Judy and Ruth work in the same hospital, Judy has three young children while Ruth has no child. therefore Ruth is less likely to pick extra shifts.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"The woman that I've been seeing has to juggle 2 part-time jobs along with being a single mother to 3 children, while my ex-girlfriend has to balance her 1 part-time job with being a mom to her 1 child with her husband, so my ex-girlfriend has more time than my current partner to do leisure activities.","sent_2":"The woman that I've been seeing has to juggle 2 part-time jobs along with being a single mother to 3 children, while my ex-girlfriend has to balance her 1 part-time job with being a mom to her 1 child with her husband, so my current partner has more time than my ex-girlfriend to do leisure activities.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Dana is a defense attorney, but her friend Perry is a software designer.  Of the two, Perry is much more likely to work with a lot of people.","sent_2":"Dana is a defense attorney, but her friend Perry is a software designer.  Of the two, Dana is much more likely to work with a lot of people.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Many people disapproved of the widow waiting one year after his wife's death to start dating again, rather than one week.","sent_2":"Many people disapproved of the widow waiting one week after his wife's death to start dating again, rather than one year.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Sam finished two projects last month whereas Ally did not complete her first so Sam is more likely to get a bonus.","sent_2":"Sam finished two projects last month whereas Ally did not complete her first so Sam is less likely to get a bonus.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"I owe $100 in credit card debt and my sister owes $10000. Thus, my brother is more likely to ask me for a loan.   ","sent_2":"I owe $100 in credit card debt and my sister owes $10000. Thus, my brother is more likely to ask her for a loan. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"I will make more money if i work 7 days a week instead of 5 days a week","sent_2":"I will make more money if i work 5 days a week instead of 7 days a week","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Colt doesn't have any kids. Finley has four kids. Therefore, Finley is more likely to go Trick or Treating. ","sent_2":"Colt doesn't have any kids. Finley has four kids. Therefore, Finley is less likely to go Trick or Treating. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Brian has just learned how to color inside of the lines while Laura has majored in art design in college.  If a company needs a new logo to make sure their sales do not dip too low, they should have Brian create one instead of Laura.","sent_2":"Brian has just learned how to color inside of the lines while Laura has majored in art design in college.  If a company needs a new logo to make sure their sales do not dip too low, they should have Laura create one instead of Brian.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Tom is 8 year old and Gavin is 23 year old, Tom is more likely to go to school","sent_2":"Tom is 8 year old and Gavin is 23 year old, Gavin is more likely to go to school","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Andy stole $100 to buy medicine for his daughter while Tim car Jacked an old lady because he needed a car for a road trip. People will be more forgiving towards Andy.","sent_2":"Andy stole $100 to buy medicine for his daughter while Tim car Jacked an old lady because he needed a car for a road trip. People will be more forgiving towards  Tim","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Susan is quite stingy. So, she decided to spend 1 dollar to rent a bike rather than paying 10 dollars to take a taxi. ","sent_2":"Susan us quite stingy. So, she decided to pay 10 dollars to take a taxi rather than spending 1 dollar to rent a bike.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"My house was built in 1950 and is fifteen hundred square feet, and my neighbor's was build 10 years ago and is three thousand square feet. My house is probably worth more than my neighbor's.","sent_2":"My house was built in 1950 and is fifteen hundred square feet, and my neighbor's was build 10 years ago and is three thousand square feet. My neighbor's house is probably worth more than mine.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Elizabeth dislikes bright and fancy colors. She would prefer a yellow dress to a black one.","sent_2":"Elizabeth dislikes bright and fancy colors. She would prefer a black dress to a yellow one.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"An 80 year old is less likely to need to use a cane to get around than an 20 year old is.","sent_2":"A 20 year old is less likely to need to use a cane to get around than an 80 year old is.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Danny smoke a lot and drink thirty beer per week while Sarah dont smoke and dont drink, Danny will probably live longer.","sent_2":"Danny smoke a lot and drink thirty beer per week while Sarah dont smoke and dont drink, Sarah will probably live longer.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Mary has 1 item in her cart, while Sara has 25 in her cart, so Sara lets Mary check out first.","sent_2":"Mary has 1 item in her cart, while Sara has 25 in her cart, so Mary lets Sara check out first.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Eric is feeling generous, and since he likes Chelsea much more than Kelsey, he decides to take Chelsea on a $5,000 shopping spree. ","sent_2":"Eric is feeling generous, and since he likes Chelsea much more than Kelsey, he decides to take Kelsey on a $5,000 shopping spree. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"John has no children to send to college and Dave has four, so John is more likely to retire early.","sent_2":"John has no children to send to college and Dave has four, so Dave is more likely to retire early.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Jane has three older sisters and Ella is an only child, so Jane is more likely to wear hand-me-down clothes.","sent_2":"Jane has three older sisters and Ella is an only child, so Ella is more likely to wear hand-me-down clothes.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Job applicant A has an iPhone 12 and all the latest gadgets, while job applicant B has an old flip phone and antiquated home technology, so job applicant A is better suited for the job at Best Buy.","sent_2":"Job applicant A has an iPhone 12 and all the latest gadgets, while job applicant B has an old flip phone and antiquated home technology, so job applicant A is not better suited for the job at Best Buy.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Emma is single and Jenny is married with a 2 year old son, so Jenny is less likely to visit a bar at 2 am.","sent_2":"Emma is single and Jenny is married with a 2 year old son, so Emma is less likely to visit a bar at 2 am.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"John and Bess live at the same apartment building, Bess is a quiet person and John holds parties at home every Friday at 3 am. Neighbors would like John more than Bess. ","sent_2":"John and Bess live at the same apartment building, Bess is a quiet person and John holds parties at home every Friday at 3 am. Neighbors would like Bess more than John.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Sarah talked to 15 people at the concert while her friend Jessica slept in the car.  Sarah got 6 new phone numbers that day.","sent_2":"Sarah talked to 15 people at the concert while her friend Jessica slept in the car.  Jessica got 6 new phone numbers that day.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"John was raised in a poor family while Kyra came from a wealthy one so John is probably better at economizing budgets.","sent_2":"John was raised in a poor family while Kyra came from a wealthy one so John is probably worse at economizing budgets.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"True"},{"sent_1":"Alan works with hazardous chemicals and Adam is a barista. Therefore, Adam is more likely to serve customers.","sent_2":"Alan works with hazardous chemicals and Adam is a barista. Therefore, Alan is more likely to serve customers.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sabrina and Shelby are siblings. Sabrina calls her parents once a day, while Shelby calls them once a week. Therefore, Shelby is closer to her parents.","sent_2":"Sabrina and Shelby are siblings. Sabrina calls her parents once a day, while Shelby calls them once a week. Therefore, Sabrina is closer to her parents.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Dean has a big apartment, but Sam has a small apartment, Dean is more likely to host a party","sent_2":"Dean has a big apartment, but Sam has a small apartment, Sam is more likely to host a party","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Usain Bolt is faster than regular man because he has been training for his entire life","sent_2":"Usain Bolt is faster than regular man because he has better genes","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sonja's family works in the construction industry while Chris's father is an accountant so Sonja is more likely to know more about buildings","sent_2":"Sonja's family works in the construction industry while Chris's father is an accountant so Chris is more likely to know more about buildings","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Daisy makes cookies for the neighborhood fair every year. This year it's less likely to take place because there is a pandemic.","sent_2":"Daisy makes cookies for the neighborhood fair every year. This year it's more likely to take place because there is a pandemic.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tanner exclusively dates men, while Chris exclusively dates women. They went to a bar and Chris took a woman home.","sent_2":"Tanner exclusively dates men, while Chris exclusively dates women. They went to a bar and Tanner took a woman home.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Chad is a gamer and Greg is a loan officer, so Chad has clients that he has to deal with.","sent_2":"Chad is a gamer and Greg is a loan officer, so Greg has clients that he has to deal with.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"As her boss is on the phone Sally decided to wait until later instead of going in.","sent_2":"As her boss is on the phone Sally decided to go in instead of to wait.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sam likes privacy, so he chose the single seat in the bus rather than the double seat. ","sent_2":"Sam likes privacy, so he chose the double seat in the bus rather than the single seat. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tom is a male while Jen is a female, so Jen is more likely to be wanted as a babysitter.","sent_2":"Tom is a male while Jen is a female, so Tom is more likely to be wanted as a babysitter.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Ted is a nurse and Max is a floor guy, so Ted's work is more likely to include exposure to different pathogens.","sent_2":"Ted is a nurse and Max is a floor guy, so Max's work is more likely to include exposure to different pathogens.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Greg is a teacher and Ted is a dentist, so Greg gets more time off from work.","sent_2":"Greg is a teacher and Ted is a dentist, so Ted gets more time off from work.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tom is a lawyer and Sally is a nurse so Tom is more likely to wear a tie to work.","sent_2":"Tom is a lawyer and Sally is a nurse so Sally is more likely to wear a tie to work.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Petunia loves peacocks while her brother Peter loves ponies.  If they have good manners this week, their mother, Pauline, should take them to the zoo.","sent_2":"Petunia loves peacocks while her brother Peter loves ponies.  If they have bad manners this week, their mother, Pauline, should take them to the zoo.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Both Sam and Ned are co-workers. Sam needs to spend time with his children, while Ned lives alone. Therefore, Sam is less likely to work overtime.","sent_2":"Both Sam and Ned are co-workers. Sam needs to spend time with his children, while Ned lives alone. Therefore, Ned is less likely to work overtime.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Charlie is a wealthy businessman who travels frequently. He is more likely to be living in his own house than in a rented apartment.","sent_2":"Charlie is a wealthy businessman who travels frequently. He is more likely to be living in a rented apartment than in his own house.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tim is a pescatarian so he prefers foods with beans rather than food with pork .","sent_2":"Tim is a pescatarian so he prefers foods with pork rather than food with beans.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jane found a wallet under the park bench. She looked inside and noticed that it belonged to her neighbor. Jane decided the best thing to do was to put it back under the bench where she found it.","sent_2":"Jane found a wallet under the park bench. She looked inside and noticed that it belonged to her neighbor. Jane decided the best thing to do was to return it to her neighbor.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jane learned clarinet while Rodger learned drums.  If a band needs a new member to keep rhythm, they should invite Rodger to join the band.  ","sent_2":"Jane learned clarinet while Rodger learned drums.  If a band needs a new member to keep rhythm, they should invite Jane to join the band.  ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Betty and Francine both have husbands that have to work a lot. Betty is understanding, and Francine is a nag. A husband is more likely to be grateful for a wife like Betty.","sent_2":"Betty and Francine both have husbands that have to work a lot. Betty is understanding, and Francine is a nag. A husband is more likely to be regretful for a wife like Betty.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Laura likes talking to people, while Craig does not.  Laura is more likely to attend the neighbor's bonfire than Craig.","sent_2":"Laura likes talking to people, while Craig does not.  Laura is less likely to attend the neighbor's bonfire than Craig.  ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Casey stole from the office vault in order to buy her baby formula, while Tonya fudged the accounting books for years to live a fancy lifestyle.  The jurors will be more forgiving towards Tonya.                                ","sent_2":"Casey stole from the office vault in order to buy her baby formula, while Tonya fudged the accounting books for years to live a fancy lifestyle.  The jurors will be more forgiving towards Casey.                                ","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tim wanted a job that paid a living wage so he decided to become a farm worker rather than a teacher.","sent_2":"Tim wanted a job that paid a living wage so he decided to become a teacher rather than a farm worker.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"James has a master's degree while Jim didn't graduate from high school, so Jim is more likely to support Donald Trump.","sent_2":"James has a master's degree while Jim didn't graduate from high school, so Jim is more likely to support Joe Biden.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Mindy went to the store to buy some milk, but Rochelle has reached for the last carton of milk first.  It would be more fair for Mindy to be able to buy the milk than it would for Rochelle.","sent_2":"Mindy went to the store to buy some milk, but Rochelle has reached for the last carton of milk first.  It would be more fair for Rochelle to be able to buy the milk than it would for Mindy.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jerry is a scuba diver and Bill is a news caster, Bill is more likely to see a shark.","sent_2":"Jerry is a scuba diver and Bill is a news caster, Jerry is more likely to see a shark.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Mark drank soda all night at the bar while Mike drank beer, therefore Mark is more at risk than Mike to be pulled over by the cops on the way home. ","sent_2":"Mark drank soda all night at the bar while Mike drank beer, therefore Mark is more at risk than Mike to be pulled over by the cops on the way home. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jim is an important manager while Tom is a janitor, so it is likely that Tom is more wealthy than Jim ","sent_2":"Jim is an important manager while Tom is a janitor, so it is likely that Jim is more wealthy than Tom ","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Dan is a very curious child; he would rather spend a free day at the playground than at the library.","sent_2":"Dan is a very curious child; he would rather spend a free day at the library than at the playground.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sam's parents are from China and Al's are from the US so Sam is more likely to speak Chinese.","sent_2":"Sam's parents are from China and Al's are from the US so Sam is less likely to speak Chinese.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Thomasina loves traveling by airplane, while Sally dislikes that mode of travel and prefers to drive a car or take a train. Thomasina would be more likely to enjoy a hot air balloon ride.","sent_2":"Thomasina loves traveling by airplane, while Sally dislikes that mode of travel and prefers to drive a car or take a train. Sally would be more likely to enjoy a hot air balloon ride.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"I had an easier time picking up women at the bar than when I went to the cafe.","sent_2":"I had a harder time picking up women at the bar than when I went to the cafe.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Mark is a forensic data analyst and Brad is a news reporter. Due to his area of expertise, Mark is more credible when it comes to determining whether election fraud took place.","sent_2":"Mark is a forensic data analyst and Brad is a television news reporter. Due to his area of expertise, Brad is more credible when it comes to determining whether election fraud took place.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jordan has just a few items in her shopping cart, and Meredith has a cart full, it makes sense to allow Jordan to go in front Meredith in line.","sent_2":"Jordan has just a few items in her shopping cart, and Meredith has a cart full, it makes sense to allow Meredith to go in front of Jordan in line.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Melvin is a woodcutter while John is a painter, so John is less likely to make wood chair rather than Melvin does.","sent_2":"Melvin is a woodcutter while John is a painter, so John is more likely to make wood chair rather than Melvin does.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Pauline is a feminist and Giselle is not. Giselle is more likely to expect men to pay for her on dates.","sent_2":"Pauline is a feminist and Giselle is not. Pauline is more likely to expect men to pay for her on dates.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jack is a baker and Sam is a loan officer, so Jack's work is more likely to include handling flour bags.","sent_2":"Jack is a baker and Sam is a loan officer, so Sam's work is more likely to include handling flour bags.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Laura is a dentist. She is likely to give her children popcorn for snacks than lollipops.","sent_2":"Laura is a dentist. She is likely to give her children lollipops for snacks than popcorn.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"John eats lunch at his work desk, and Joe eats in the cafeteria. John is more likely to work during lunch.","sent_2":"John eats lunch at his work desk, and Joe eats in the cafeteria. Joe is more likely to work during lunch.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"If Maggie wants to get a pet with whom she could have a conversation, she should get a parrot rather than a tarantula.","sent_2":"If Maggie wants to get a pet with whom she could have a conversation, she should get a tarantula rather than a parrot.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Nasir is a devout believer in God and Krista is an atheist. Nasir is more likely to attend a religious ceremony than Krista.","sent_2":"Nasir is a devout believer in God and Krista is an atheist. Krista is more likely to attend a religious ceremony than Nasir .","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sandra has studied every day for the exam for years and the night before she got a terrible flu so she's not likely to perform well.","sent_2":"Sandra has studied every day for the exam for years and the night before she got a gift so she's not likely to perform well.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Lance is a scuba diving instructor, he is more likely to perform his work duties in water than Josh who is a librarian","sent_2":"Lance is a scuba diving instructor, he is less likely to perform his work duties in water than Josh who is a librarian. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"I prefer a stronger more bitter coffee, whereas my sister prefers a smoother, lighter coffee, so I like Starbucks better than my sister does.","sent_2":"I prefer a stronger more bitter coffee, whereas my sister prefers a smoother, lighter coffee, so my sister likes Starbucks better than I do.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Case is a doctor and while on his way to the hospital to perform emergency surgery, he ran a red light. Macy ran a red light on her way to the mall. The police officer is more lenient to Case for running the red light. ","sent_2":"Case is a doctor and while on his way to the hospital to perform emergency surgery, he ran a red light. Macy ran a red light on her way to the mall. The police officer is more severe to Case for running the red light. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Nancy wisely chose to make eggplant parmigiana rather than veal parmigiana for her Hindu friends.","sent_2":"Nancy wisely chose to make veal parmigiana rather than eggplant parmigiana for her Hindu friends.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Karen has a phobia of sea animals, so she would rather go to the aquarium than to the concert. ","sent_2":"Karen has a phobia of sea animals, so she would rather go to the concert than to the aquarium.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Bruno has no allergies while Brandon is allergic to cats so Brandon has no cats","sent_2":"Bruno has no allergies while Brandon is allergic to cats so Brandon has two cats","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jim often leaves work after Tim so Jim ended up getting a bonus at the end of the year.","sent_2":"Jim often leaves work after Tim so Tim ended up getting a bonus at the end of the year.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Mary has a vocal dog, and Claire has a quiet kitten. Neighbors likely hear Mary's pet more often.","sent_2":"Mary has a vocal dog, and Claire has a quiet kitten. Neighbors likely hear Claire's pet more often.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Cigars are often more expensive than cigarettes.","sent_2":"Cigarettes are often more expensive than cigars.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Greg has a union job and Jim is a gig worker so Greg gets better benefits in his job.","sent_2":"Greg has a union job and Jim is a gig worker so Jim gets better benefits in his job.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jim is a baseball coach, so he is more likely to teach his son how to swing than how to tackle.","sent_2":"Jim is a baseball coach, so he is more likely to teach his son how to tackle than how to swing.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"I saw Joan a few hours ago while I haven't met Anne since ages, so I hugged Anne more heartily than Joan","sent_2":"I saw Joan a few hours ago while I haven't met Anne since ages, so I hugged Joan more heartily than Anne","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jessica invited Melanie over to see her new apartment, so it makes sense that Melanie would bring Jessica a gift.","sent_2":"Jessica invited Melanie over to see her new apartment, so it makes sense that Jessica would give Melanie a gift.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Ted is in high school and Tom is in elementary school so Ted is more likely to be a tutor.","sent_2":"Ted is in high school and Tom is in elementary school so Ted is less likely to be a tutor.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Naomi has a sick child in the hospital while Susan wants to go for hike , Naomi is more likely to be given a day off than Susan","sent_2":"Naomi has a sick child in the hospital while Susan wants to go for hike , Susan is more likely to be given a day off than Naomi","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sam has a family, including several small children that he takes care of when he's not working. His friend Don is single and likes to run, exercise, and attend concerts. Sam is more likely than Don to stay home on the weekends.","sent_2":"Sam has a family, including several small children that he takes care of when he's not working. His friend Don is single and likes to run, exercise, and attend concerts. Don is more likely than Sam to stay home on the weekends.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Matt works for a paper supplier and Ned works for a hospital as a janitor. Ned is more likely than Matt to work during the night.","sent_2":"Matt works for a paper supplier and Ned works for a hospital as a janitor. Ned is more likely than Matt to work during the day.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jack was an acquaintance to Datson and William was his friend, so Datson  is more likely to get a gift for William.","sent_2":"Jack was an acquaintance to Datson and William was his friend, so Datson  is more likely to get a gift for  Jack.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jacob wanted to buy a firearm to protect himself without spending too much, so he bought a pistol instead of a shotgun.","sent_2":"Jacob wanted to buy a firearm to protect himself without spending too much, so he bought a shotgun instead of a pistol.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Since John is a teetotaller, Jack is likely to offer him softdrinks than whisky.","sent_2":"Since John is a teetotaller, Jack is likely to offer him whisky than softdrinks.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"The boys horse around on the jungle gym, while the girls sit on the benches, so the boys are more likely to fall and get hurt.","sent_2":"The boys horse around on the jungle gym, while the girls sit in the benches, so the girls are more likely to fall and get hurt.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tammy dreams of having children and Ella is in her final months so Ella is more likely to buy diapers before Tammy.","sent_2":"Tammy dreams of having children and Ella is in her final months so Tammy is more likely to buy diapers before Ella.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tim is an accountant while Bill is a SCUBA instructor; Tim is probably busier at tax season than Bill.","sent_2":"Tim is an accountant while Bill is a SCUBA instructor; Bill is probably busier at tax season than Tim.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"John wants to be able to pay off his tuition in full while he attends college, so he will attend the military for assistance instead of taking up an office job.","sent_2":"John wants to be able to pay off his tuition in full while he attends college, so he will take up an office job for assistance instead of attending the military.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jon was rushing to the hospital for an emergency.  The police officer will be more likely to give him a warning for speeding","sent_2":"Jon was rushing to the hospital for an emergency.  The police officer will be less likely to give him a warning for speeding","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Mary looks quite intimidating. She would make a better sales marketer than a security guard.","sent_2":"Mary looks quite intimidating. She would make a better security guard than a sales marketer.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tom studies computer science in college and Jerry studies anthropology in college, so Jerry is more likely to go to a village to do field work.","sent_2":"Tom studies computer science in college and Jerry studies anthropology in college, so Tom is more likely to go to a village to do field work","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"John worked as a biologist before and Jane as a pilot so John is more likely to be asked to help find a COVID cure. ","sent_2":"John worked as a biologist before and Jane as a pilot so John is less likely to be asked to help find a COVID cure. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Tim and Brad live in adjacent apartments. Unlike Brad, Tim makes a lot of mess outside by eating sunflower seeds The building maintenance staff will probably find it easier to clean after Brad.","sent_2":"Tim and Brad live in adjacent apartments. Unlike Brad, Tim makes a lot of mess outside by eating sunflower seeds The building maintenance staff will probably find it easier to clean after Tim.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Susan deliver food at my door while Jim came in to fix the water issue, Jim is more likely to enter in my house.","sent_2":"Susan deliver food at my door while Jim came in to fix the water issue, Susan is more likely to enter in my house.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"I would prefer the old car with less miles than the new car with more miles","sent_2":"I would prefer the old car with more miles than the new car with less miles","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sarah is a quadriplegic and Amirah isn't, so Amirah is more likely to enjoy vacuuming her house than Sarah.","sent_2":"Sarah is a quadriplegic and Amirah isn't, so Sarah is more likely to enjoy vacuuming her house than Amirah.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Todd is a waiter and Chris is a police officer, so Chris is more likely to be injured while on the job than Todd. ","sent_2":"Todd is a waiter and Chris is a police officer, so Todd is more likely to be injured while on the job than Chris. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Kent works at a grocery store and Megan works at a hospital, so Megan's job is more likely to give medications. ","sent_2":"Kent works at a grocery store and Megan works at a hospital, so Kyle's job is more likely to give medications. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Since the children are not behaving Sally is less likely to give them the surprise.","sent_2":"Since the children are not behaving Sally is more likely to give them the surprise.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Amanda has blue hair and Stephanie has brown hair. A conservative law firm is more likely to hire Amanda than Stephanie.","sent_2":"Amanda has blue hair and Stephanie has brown hair. A conservative law firm is less likely to hire Amanda than Stephanie.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Alex's wife is in the Army. Sam's wife is a teacher. Therefore, Alex's wife is more likely to get deployed overseas.","sent_2":"Alex's wife is in the Army. Sam's wife is a teacher. Therefore, Alex's wife is less likely to get deployed overseas. ","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jane wanted to change her hairstyle for a job interview, so she put it into a ponytail rather than into braids.","sent_2":"Jane wanted to change her hairstyle for a job interview, so she put it into braids rather than into a ponytail.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":" Tim is obese and Rick is fit, so Tim is more likely to die prematurely from heart disease.","sent_2":" Tim is obese and Rick is fit, so Rick is more likely to die prematurely from heart disease.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"The prisoners all saw the new prison inmates come into the prison, they decided they would most likely harass the smaller inmates.","sent_2":"The prisoners all saw the new prison inmates come into the prison, they decided they would most likely respect the smaller inmates.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Gina and Heather are twins but Gina is overweight and Heather is thin. Gina is less likely to get matches on Tinder.","sent_2":"Gina and Heather are twins but Gina is overweight and Heather is thin. Heather is less likely to get matches on Tinder.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Joseph was a financial adviser who wanted to date Kathy, his part-time assistant, so it's expected for Joseph to buy more expensive gifts.","sent_2":"Joseph was a financial adviser who wanted to date Kathy, his part-time assistant, so it's expected for Kathy to buy more expensive gifts.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Thomas likes to take walks to think, and he thinks best in the rain. Howard also likes to walk, but he hates walking in the rain. Howard is more likely than Thomas to head home from his walk when it starts to get cloudy.","sent_2":"Thomas likes to take walks to think, and he thinks best in the rain. Howard also likes to walk, but he hates walking in the rain. Thomas is more likely than Howard to head home from his walk when it starts to get cloudy.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Ted was at his wedding, and he thought that it would make more sense for his best man to throw the bouquet.","sent_2":"Ted was at his wedding, and he thought that it would make more sense for his bride to throw the bouquet.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Charles received an athletic scholarship while Brandon has an academic scholarship, so you are more likely to find Charles at the pool than Brandon.","sent_2":"Charles received an athletic scholarship while Brandon has an academic scholarship, so you are more likely to find Brandon at the pool than Charles.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Bobby is newly single and decided to go on a cruise. He will probably choose to go to the speed dating event over couple's therapy.","sent_2":"Bobby is newly single and decided to go on a cruise. He probably won't choose to go to the speed dating event over couple's therapy.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jon's a firefighter and Pat is a police officer, so Jon spends more time not working.","sent_2":"Jon's a firefighter and Pat is a police officer, so Pat spends more time not working.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jay has student loans while Joan has none, so it's more expected for Joan to buy newer TVs.","sent_2":"Jay has student loans while Joan has none, so it's more expected for Jay to buy newer TVs.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jan is an exercise instructor and Ed is a desk worker. Therefore, Jan is likely to be more fit.","sent_2":"Jan is an exercise instructor and Ed is a desk worker. Therefore, Jan is likely to be less fit.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sarah has never been good at drawing, but has a great idea for a comic she wants to make with her friend Diane, who is not a great writer.  If they decide to produce the comic, Sarah should be the writer and Diane should be the artist.","sent_2":"Sarah has never been good at drawing, but has a great idea for a comic she wants to make with her friend Diane, who is not a great writer.  If they decide to produce the comic, Sarah should be the artist and Diane should be the writer.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Vicky could help her sister Eleanor with her math homework, because Vicky was a junior, and Eleanor was a freshman.","sent_2":"Vicky could help her sister Eleanor with her math homework, because Eleanor was a junior, and Vicky was a freshman.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jane is a professional baker but she refuses to use special ingredients so when a customer asked for a gluten free vegan cake she said no.","sent_2":"Jane is a professional baker but she refuses to use special ingredients so when a customer asked for a gluten free vegan cake she said sure.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Bob and Sally are neighbors. Bob makes noise all the time, while Sally is a quiet tenant, therefore Bob is more likely to get evicted.","sent_2":"Bob and Sally are neighbors. Bob makes noise all the time, while Sally is a quiet tenant, therefore Bob is less likely to get evicted.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jack stole from a neighbor to feed his family, while Tim robbed a bank to spend it on gambling, therefore a jury would be more forgiving towards Jack.","sent_2":"Jack stole from a neighbor to feed his family, while Tim robbed a bank to spend it on gambling, therefore a jury would be less forgiving towards Jack.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Mr. Smith is a welder and Mrs. Smith is a doctor, so Mrs. Smith is more likely to have gone to a trade school. ","sent_2":"Mr. Smith is a welder and Mrs. Smith is a doctor, so Mr. Smith is more likely to have gone to a trade school. ","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jane lives in New York and James lives in Japan, Jane would have an easier time speaking Japanese.","sent_2":"Jane lives in New York and James lives in Japan, James would have an easier time speaking Japanese.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Edward is going home because he is sick and Tom is staying at the office. Tom is more likely to turn off the lights.","sent_2":"Edward is going home because he is sick and Tom is staying at the office. Edward is more likely to turn off the lights.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jesse works full time at a packing warehouse whereas Jamie works at home part time; therefore Jamie would be less likely to place her child in daycare. ","sent_2":"Jesse works full time at a packing warehouse whereas Jamie works at home part time; therefore Jamie will be more likely to place her child in daycare.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"If you like interaction with strangers, you might want to ride a bus rather than drive your car to work.","sent_2":"If you dislike interaction with strangers, you might want to ride a bus rather than drive your car to work.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Sam left a snack basket for the mail carriers.  Laura left nothing for the mail carriers.  The mail carriers like to deliver to Laura's house more than Sam's house.","sent_2":"Sam left a snack basket for the mail carriers.  Laura left nothing for the mail carriers.  The mail carriers like to deliver to Sam's house more than Laura's house.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jerry is a violinist and Kayla is a drummer, so Jerry is more likely to see Kayla play at a rock concert.","sent_2":"Jerry is a violinist and Kayla is a drummer, so Kayla is more likely to see Jerry play at a rock concert.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jeff is vegan and Harrison is not, so Harrison is more likely to make meatloaf for dinner.","sent_2":"Jeff is vegan and Harrison is not, so Jeff is more likely to make meatloaf for dinner.","label_1":"True","label_2":"False","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Jenny is much taller than Rhonda, so Jenny is less likely to be picked for the basketball team.","sent_2":"Jenny is much taller than Rhonda, so Jenny is more likely to be picked for the basketball team.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"Zoe looks after the elephants in the zoo, while Barry looks after the jaguars.  Zoe is much more likely than Barry to require raw meat to do her job.","sent_2":"Zoe looks after the elephants in the zoo, while Barry looks after the jaguars.  Barry is much more likely than Zoe to require raw meat to do her job.","label_1":"False","label_2":"True","domain":"social","scenario":"comparison","numeracy":"False"},{"sent_1":"If the order takes 5 days to prepare, she will tell the customer it will be ready tomorrow.","sent_2":"If the order takes 5 days to prepare, she will tell the customer it will be ready in a week.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If a person reads 30 pages every day and book has 300 pages, with one day break from reading, person will finish the book in 11 days","sent_2":"If a person reads 30 pages every day and book has 300 pages, with one week break from reading, person will finish the book in 16 days","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If you are going to take a long trip to Florida, it is best to go during summer break so that the kids don't miss school.","sent_2":"If you are going to take a long trip to Florida, it is best to go during summer break so that the kids will miss school.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Before they go to school, Jay's mother makes her sibling finish their homework that is assigned that day. ","sent_2":"After they go to school, Jay's mother makes her sibling finish their homework that is assigned that day. ","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Sean had thirty minutes for a lunch break so he ordered a carry-out sandwich.","sent_2":"Sean had thirty minutes for a lunch break so he ordered a three-course meal.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"There was a car accident on the freeway, and Mary lives a block away from her work, so her commute won't take her longer than normal.","sent_2":"There was a car accident on the freeway, and Mary lives a block away from her work, so her commute will take her longer than normal.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since I work from 7 am to 7 pm, I find it difficult to visit a bank.","sent_2":"Since I work from 7 pm to 7 am, I find it difficult to visit a bank.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"December is approaching so that John's store in Australia sells out coats and mittens quickly","sent_2":"December is approaching so that John's store in Australia sells out fans quickly","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because I'm often dehydrated, I need to remember to drink a glass of water hourly.","sent_2":"Because I'm often dehydrated, I need to remember to drink a glass of water weekly.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since I was meeting my friend for lunch, I parked in a spot with a two hour time limit.","sent_2":"Since I was meeting my friend for lunch and a movie, I parked in a spot with a two hour time limit.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since she does not work until tonight she can go to the store this morning.","sent_2":"Since she does not work until tonight she cannot go to the store this morning.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because dinner is in an hour I will start cooking in a few minutes.","sent_2":"Because dinner is in an hour I will start cooking in a few hours.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"The movie will start at 3:00 PM, so the couple wants to go the theatre by 3:30 PM","sent_2":"The movie will start at 3:00 PM, so the couple wants to go the theatre by 2:30 PM","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"As the ice was kept outside freezer for a very long time, it was melted. ","sent_2":"As the ice was kept outside freezer for a very short time, it was melted. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Sam had to be home before the streetlights came on, so he was sure to get inside before sunset.","sent_2":"Sam had to be home before the streetlights came on, so he was sure to get inside before dawn.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because the dentist cleaned my teeth today, I made an appointment for another cleaning in six months.","sent_2":"Because the dentist cleaned my teeth today, I made an appointment for another cleaning tomorrow.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"I needed to get to work, so I had to think about how long it would take the next bus to arrive, I estimated about 10 minutes.","sent_2":"I needed to get to work, so I had to think about how long it would take the next bus to arrive, I estimated about 10 hours.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Anita was furious when Robert spilled cranberry juice on her expensive white rug because it stains badly. ","sent_2":"Anita was furious when Robert spilled water on her expensive white rug because it stains badly. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Sam wanted to see the stars in the sky so he went outside at midnight.","sent_2":"Sam wanted to see the stars in the sky so he went outside at dawn.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Sara aims to get the recommended 8 hours of sleep and has to get up for work at 9:00AM. In order to achieve this goal, Sara would need to go to bed at 1:00AM. ","sent_2":"Sara aims to get the recommended 8 hours of sleep and has to get up for work at 9:00AM. In order to achieve this goal, Sara would need to go to bed at 5:00AM. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Because it was winter in Australia, I had to wear a t-shirt.","sent_2":"Because it was winter in New York, I had to wear a t-shirt.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Joe has one day of vacation time to use, so he's going to take a trip to China instead of the local beach.","sent_2":"Joe has one month of vacation time to use, so he's going to take a trip to China instead of the local beach.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Tim took a nap for 8 hours which made him better able to complete his chores.","sent_2":"Tim took a nap for 1 hour which made him better able to complete his chores.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If I am looking for diamonds, I should mine somewhere where the contents have been under pressure for one billion years.","sent_2":"If I am looking for diamonds, I should mine somewhere where the contents have been under pressure for one hundred years.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Tim was happy that November was coming up since he'd have a lot of time off from school.","sent_2":"Tim was happy that May was coming up since he'd have a lot of time off from school.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Due to the heavy rain in the last four days, the stadium were flooded with ice","sent_2":"Due to the heavy rain in the last four days, the stadium were flooded with water","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Tom had to work the night shift so he got home from work at 5 PM.","sent_2":"Tom had to work the night shift so he got home from work at 10 PM.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"The recipe said the cake needed to bake for two more hours, so Amy decided to take a nap while she waited.","sent_2":"The recipe said the cake needed to bake for two more minutes, so Amy decided to take a nap while she waited.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Jack rode his Tesla for 4 hours so it was going to run out of gas.","sent_2":"Jack rode his Lexus for 4 hours so it was going to run out of gas.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Jane was cooking a frozen turkey for dinner, so she took it out of the freezer the day before.","sent_2":"Jane was cooking a frozen turkey for dinner, so she took it out of the freezer an hour before dinner.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"John and Amy started walking up the mountain this morning and are  unlikely to complete the 96 hour trek by this evening.","sent_2":"John and Amy started walking up the mountain this morning and are likely to complete the 96 hour trek by this evening.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Working back shift at the gas station makes me worry about getting robbed.","sent_2":"Working back shift at the gas station makes me not worry about getting robbed.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Tim was missing for 2 weeks so his family was concerned on whether he was still alive.","sent_2":"Tim was missing for 2 hours so his family was concerned on whether he was still alive.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If I start cooking a pizza now, it should be done in less than an hour.","sent_2":"If I start cooking a pizza now, it should be done in less than a second.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"If I spit a grape through the air and into the other room, it would probably not hit the floor until a second or two later.","sent_2":"If I spit a grape through the air and into the other room, it would probably not hit the floor until a minute or two later.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Bob lost all of his money gambling on blackjack 10 years ago, he's still upset.","sent_2":"Bob lost all of his money gambling on blackjack 3 weeks ago, he's still upset.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Knowing she was going to see a double feature Kelly set her phone volume on silent during the movie.","sent_2":"Knowing she was going to see a double feature Kelly set her phone volume on high during the movie.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"To leave for a 9pm movie show, Rajesh must finish his dinner by 8:30pm to reach on time.","sent_2":"To leave for a 9pm movie show, Rajesh must finish his dinner by 9pm to reach on time.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"John knew that the accident was going to slow down his commute by 10 minutes so he planned to 5 minutes earlier to ensure he'd be on time.","sent_2":"John knew that the accident was going to slow down his commute by 10 minutes so he planned to leave 15 minutes earlier to ensure he'd be on time.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If the new Super Hero movie premieres at 7 pm tonight, I will have to be ready a few minutes before to see it.","sent_2":"If the new Super Hero movie premieres at 7 pm tonight, I will have to be ready by 8 pm to see it.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"John was late for the office today, so instead of breakfast he ate yesterday's dinner.","sent_2":"John was late for the office today, so instead of breakfast he ate tomorrow's dinner.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because the delivery man took two hours to deliver our pizza, it will be cold.","sent_2":"Because the delivery man took 20 minutes to deliver our pizza, it will be cold.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If the train journey to the destination takes 45 minutes, it is not likely that we will be at our destination in 25 minutes.","sent_2":"If the train journey to the destination takes 45 minutes, it is likely that we will be at our destination in 25 minutes.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"When I'm attending school for 10 hours a day, I then have 14 hours to do my homework.","sent_2":"When I'm attending school for 10 hours a day, I then have 2 hours to do my homework.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"The girl's appointment was at 8am, so she had a lot of time to get to her class at 8:30am","sent_2":"The girl's appointment was at 8am, so she had very little time to get to her class at 8:30am","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because Michelle's audition is in Los Angeles early tomorrow morning, she will fly from New York to Los Angeles today.","sent_2":"Because Michelle's audition is in Los Angeles early tomorrow morning, she will drive from New York to Los Angeles today.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Tara went on a walk with her dog that usually takes sixty minutes, so it is likely she will not be home for at least five hours.","sent_2":"Tara went on a walk with her dog that usually takes sixty minutes, so it is likely she will not be home for at least one hour.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If your doctor says to take your medicine once every six hours and you just had a pill two hours ago, you should take another pill in ten minutes.","sent_2":"If your doctor says to take your medicine once every six hours and you just had a pill two hours ago, you should take another pill in four hours.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"We will leave as soon as this sitcom is over, so be ready in 30 minutes","sent_2":"We will leave as soon as this sitcom is over, so be ready in 3 hours.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Jason likes to work during back shift at the grocery store because there are less customers.","sent_2":"Jason likes to work during back shift at the grocery store because there are more customers.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"During the winter on northern hemisphere, it is summer in Australia","sent_2":"During the winter on northern hemisphere, it is summer in Saudi Arabia","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since I had an eight hour drive ahead of me I filled up my gas tank before I left.","sent_2":"Since I had an eight hour drive ahead of me I decided not to fill my gas tank before I left.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since she hasn't started her new job yet, she hasn't completed the forty hours of necessary orientation training.","sent_2":"Since she hasn't started her new job yet, she has already completed the forty hours of necessary orientation training.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Marcie has several houseplants, and she makes sure to water them about once or twice a week.","sent_2":"Marcie has several houseplants, and she makes sure to water about once or twice a year.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"It was noon, so John decided to get his telescope and do some stargazing.","sent_2":"It was midnight, so John decided to get his telescope and do some stargazing.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Trevor is extremely hungry, so he would likely be happy to eat in 5 hours.","sent_2":"Trevor is extremely hungry, so he would likely be happy to eat in 5 minutes.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"The longest gap between meals for most people is between dinner and breakfast.","sent_2":"The longest gap between meals for most people is between breakfast and brunch.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"If I am both tired and hungry at work and I have an hour lunch break, I would want to sleep for half an hour instead of a full hour so I can still eat lunch.","sent_2":"If I am both tired and hungry at work and I have an hour lunch break, I would want to sleep for a full hour instead of half an hour so I can still eat lunch.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"The battery on Pat's phone just ran out so he needed to charge it for at least 10 minutes to get it fully charged.","sent_2":"The battery on Pat's phone just ran out so he needed to charge it for at least 60 minutes to get it fully charged.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Johnny shipped out the chemistry textbook from his Arizona home to his cousin in Germany because she has an exam in an hour.","sent_2":"Johnny shipped out the chemistry textbook from his Arizona home to his cousin in Germany because she has an exam in a month.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since the electricity was out for ten days, the frozen items in my freezer had thawed.","sent_2":"Since the electricity was out for ten minutes, the frozen items in my freezer had thawed.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Having had a late lunch I decided to move my dinner reservation back two hours.","sent_2":"Having had a late lunch I decided to move my dinner reservation up two hours.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Brad went to sleep at 4pm, so he missed the overnight meteor shower. ","sent_2":"Brad went to sleep at 4pm, so he saw the overnight meteor shower. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"For pumpkins to be ready for Halloween, their seeds must be planted in early April.","sent_2":"For pumpkins to be ready for Halloween, their seeds must be planted in early October.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"A human being can legally drink alcohol after 30 years of living.","sent_2":"A human being can not legally drink alcohol after 30 years of living.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since the baseball game starts at 7 pm, there will probably be fireworks afterward.","sent_2":"Since the baseball game starts at 1 pm, there will probably be fireworks afterward.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since I live in southern Australia, daylight lasts over 12 hours on Christmas.","sent_2":"Since I live in southern Australia, daylight lasts under 12 hours on Christmas.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"His carefully planned-out day was ruined when his train arrived three hours late.","sent_2":"His carefully planned-out day was ruined when his train arrived three minutes late.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"She used her two hour commute to grade her students' papers.","sent_2":"She used her two minute commute to grade her students' papers.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"The basketball game will start in 10 minutes, so Craig will be able to buy a new pair of shoes before the basketball game starts.","sent_2":"The basketball game will start in 10 minutes, so Craig will not be able to buy a new pair of shoes before the basketball game starts.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"As winter approaches in North America, the average daily temperature decreases.","sent_2":"As winter approaches in North America, the average daily temperature increases.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since it's a leap year, we have an extra day this year.","sent_2":"Since it's not a leap year, we have an extra day this year.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"If the government decides today to form more engineers, it'll take at least four years to see the results.","sent_2":"If the government decides today to form more engineers, it'll take no more than a year to see the results.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"The sun sets at six o'clock in the evening, so Tim leaves the porch light on when he leaves at eight o'clock in the morning because he knows he will be gone for twelve hours.","sent_2":"The sun sets at six o'clock in the evening, so Tim leaves the porch light on when he leaves at eight o'clock in the morning because he knows he will be gone for seven hours.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If I do not want to miss an important piece of mail that I need to respond to the next day, I should check my mailbox once per hour at the very least.","sent_2":"If I do not want to miss an important piece of mail that I need to respond to the next day, I should check my mailbox once per day at the very least.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Before Robin was born, everyone said he had his mother's eyes. ","sent_2":"After Robin was born,  everyone said he had his mother's eyes. ","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"As the band starts playing in 30 seconds,  she'll miss the first song if she goes to the restroom now. ","sent_2":"As the band starts playing in 30 minutes,  she'll miss the first song if she goes to the restroom now. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since the party is tomorrow, I have time to go and buy a fantastic dress.","sent_2":"Since the party is in a few minutes, I have time to go and buy a fantastic dress.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Feeling my blood sugar drop I decided to order the appetizers because the main course was still two hours away.","sent_2":"Feeling my blood sugar drop I decided not to order the appetizers because the main course was still two hours away.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Because he played ping pong for two hours without stopping, he is thirsty.","sent_2":"Because he played ping pong for one minute without stopping, he is thirsty.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"As the exam is postponed, he will  allot lesser time per day for his studies.","sent_2":"As the exam is postponed, he will  allot more time per day for his studies.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because I get off work around 10:00 pm, so it is usually dark outside.","sent_2":"Because I get off work around 10:00 pm, so it is usually light outside.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Shivani binge watches her show on Saturday nights so she can sleep all day on Sunday.","sent_2":"Shivani binge watches her show on Saturday nights so she can wake up early on Sunday.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Because my three-year-old was on a sugar high, I did not expect her to calm down for hours.","sent_2":"Because my three-year-old was on a sugar high, I expected her to calm down shortly.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"The bus comes every 20 minutes, so he plans to wait at max 20 minutes to catch the next one.","sent_2":"The bus comes every 20 minutes, so he plans to wait at max 1 hour to catch the next one.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Lisa needed to submit her paper in a month, so she had plenty of time to do research. ","sent_2":"Lisa needed to submit her paper in a day, so she had plenty of time to do research. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since summer was coming up, Stan got to wear shorts again.","sent_2":"Since autumn was coming up, Stan got to wear shorts again.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Lucy is watching a movie that has 40 minutes left, she has to pick up her kids in 10 minutes so she should finish the movie now.","sent_2":"Lucy is watching a movie that has 40 minutes left, she has to pick up her kids in 60 minutes so she should finish the movie now.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"She cannot go to the store before work because she will only have five minutes.","sent_2":"She cannot go to the store before work because she will only have five hours.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"After Jim's 16th birthday, his dad took him to get his driver's license","sent_2":"After Jim's 13th birthday, his dad took him to get his driver's license","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"If I shave my head today, I'll have a foot of hair growth by tomorrow.","sent_2":"If I shave my head today, I'll have a foot of hair growth by next year.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Alice has 30 minutes until she has to submit her essay so she has time to perform more research on the subject.","sent_2":"Alice has 30 minutes until she has to submit her essay so she does not have time to perform more research on the subject.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since the kids get home from soccer practice in four hours, I should start making dinner now.","sent_2":"Since the kids get home from soccer practice in half an hour, I should start making dinner now.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"As he started learning the violin since yesterday, it is not likely that he will be part of the orchestra this Saturday.","sent_2":"As he started learning violin since yesterday, it is likely that he will be part of the orchestra this Saturday.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Karen is going on a weekend camping trip with her friends, which means she will be gone for seven days.","sent_2":"Karen is going on a weekend camping trip with her friends, which means she will be gone for two days.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Johnson was born on 29th February, he throws a big party every 4th year, on his actual birth date.","sent_2":"Johnson was born on 29th February, he throws a big party every year, on his actual birth date.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since Mary is having a Caesarean section in 2 hours, she has a lot of time to give her family directions to the hospital.","sent_2":"Since Mary is having a Caesarean section in 2 hours, she has no time to give her family directions to the hospital.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Frank wanted a soft boiled egg so he put the egg in boiling water and while he waited he decided to listen to music rather than read a novel.","sent_2":"Frank wanted a soft boiled egg so he put the egg in boiling water and while he waited he decided to read a novel rather than listen to music.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"If it only takes me a half hour to get ready for work, and my alarm goes off an hour before I have to leave, I can comfortably hit the snooze alarm five times.","sent_2":"If it only takes me a half hour to get ready for work, and my alarm goes off an hour before I have to leave, I can comfortably hit the snooze alarm once or twice.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Jim had a school exam, so he learned a lot before the exam.","sent_2":"Jim had a school exam, so he learned a lot after the exam.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Jane got some weird looks because she wore sunglasses outside at 4 PM.","sent_2":"Jane got some weird looks because she wore sunglasses outside at 4 AM.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"John had to drive at midnight, so he was sure to wear his sunglasses.","sent_2":"John had to drive at noon, so he was sure to wear his sunglasses.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"It was the middle of winter, so he was sure to wear a warm coat.","sent_2":"It was the middle of summer, so he was sure to wear a warm coat.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Paul called a taxi at 5 pm to get to a next door neighbor's party at 6 pm.","sent_2":"Paul called a taxi at 5 pm to get to a party 3 miles away from his place at 6 pm.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If I buy the ingredients for pizza tomorrow, I can have it for dinner tonight.","sent_2":"If I buy the ingredients for pizza tomorrow, I can eat pizza tomorrow.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"John has a mandatory Zoom meeting in 10 minutes, so he has time for a quick breakfast.","sent_2":"John has a mandatory Zoom meeting in 2 hours, so he does not have time for a quick breakfast.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If a football team is down 7 points with 1 minute left, it would be difficult to make a comeback.","sent_2":"If a football team is down 7 points with 30 minutes left, it would be difficult to make a comeback.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"New karate student, Bob, knows that with hard work, he can get his black belt in 4 years.","sent_2":"New karate student, Bob, knows that with hard work, he can get his black belt in 4 months.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"I decided to grow a tree so that my family could benefit from it in 5 months.","sent_2":"I decided to grow a tree so that my family could benefit from it in 5 decades.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Tasha usually ran a mile and showered in the morning before her work at 9 am, so she left for run at 8 am. ","sent_2":"Tasha usually ran a mile and showered in the morning before her work at 9 am, so she left for run at 8:40 am. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"At night I sleep for six hours, I wake up when the sun rises.","sent_2":"At night I sleep for six hours, I wake up when the sun sets.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Lisa usually goes to bed by 10 pm, so she wanted to read a chapter of a book at 9:30 pm. ","sent_2":"Lisa usually goes to bed by 10 pm, so she wanted to read 10 chapters of a book at 9:30 pm. ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Her flight leaves in 3 hours, so she's planning on taking 20 minutes to get to the airport by taxi.","sent_2":"Her flight leaves in 3 hours, so she's planning on taking 3 hours to get to the airport by bicycle.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"When you have to be at the school by 9:00 AM then you must leave the house by 9:00 AM","sent_2":"When you have to be at the school by 9:00 AM then you must leave the house by 8:00 AM","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since I want to improve my golf game, I spend 2 hours on the course every day.","sent_2":"Since I want to improve my golf game, I spend 200 minutes on the course every decade.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"I planted some tulip bulbs in the fall, so I can expect for them to bloom next spring.","sent_2":"I planted some tulip bulbs in the fall, so I can expect for them to bloom next winter.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":" As she has to be at school in 10 minutes, she has to hurry up to make it across the town.","sent_2":" As she has to be at school in 10 hours, she has to hurry up to make it across the town.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Kelly got in trouble because she took a bathroom break at school and didn’t return to class for five minutes. ","sent_2":"Kelly got in trouble because she took a bathroom break at school and didn’t return to class for thirty minutes. ","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"The robber made a poor choice of vehicle to get away in, so the cop cars took 2 minutes to catch up to the robber who on his bicycle.","sent_2":"The robber made a poor choice of vehicle to get away in, so the cop cars took 2 hours to catch up to the robber who on his bicycle.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"John leaves work at 6 pm so that he is an unlikely suspect for theft that happened in the office at 8 pm.","sent_2":"John leaves work at 6 pm so that he is a likely suspect for theft that happened in the office at 8 pm.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Since my boss asked for the report right away, I'd better work on it before grabbing lunch.","sent_2":"Since my boss asked for the report right away, I'd better work on it after grabbing lunch.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"I only have 4 years until I graduate and we want to get married before I have a degree, and so we are planning our wedding for 3 years from now.","sent_2":"I only have 4 years until I graduate and we want to get married before I have a degree, and so we are planning our wedding for 5 years from now.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If you plant a patch of tomatoes, they will likely be grown in 1 day.","sent_2":"If you plant a patch of tomatoes, they will likely be grown in 1 month.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"With her Study Abroad opportunity cancelled for next year, Tracey decided to renew her lease.","sent_2":"With her Study Abroad opportunity approved for next year, Tracey decided to renew her lease.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Since it's raining and my window is broken, I should cover the opening with a tarp now.","sent_2":"Since it's raining and my window is broken, I should cover the opening with a tarp later.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Rebecca's wedding was today, so she put on her dress during the ceremony.","sent_2":"Rebecca's wedding was today, so she put on her dress before the ceremony.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Pam's friend will pick her up in 5 minutes, so she should walk her dog later.","sent_2":"Pam's friend will pick her up in 5 minutes, so she should walk her dog now.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Amanda has an appointment in fifteen minutes, so she should probably take a nap.","sent_2":"Amanda has an appointment in fifteen minutes, so she shouldn't probably take a nap.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"From her house, it takes June about 30 minutes to get to the bus stop and 20 minutes to walk to school, so she doesn't take the bus.","sent_2":"From her house, it takes June about 30 minutes to get to the bus stop and 20 minutes to walk to school, so she takes the bus.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Maxwell running very fastly to the office, because he has enough time to reach there","sent_2":"Maxwell running very fastly to the office, because he dont have enough time to reach there","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"Not expecting the morning meeting to last five hours, she made an early lunch reservation.","sent_2":"Expecting the morning meeting to last five hours, she made an early lunch reservation.  ","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Global warming can cause global temperatures to increase 90 degrees Celsius in one year.","sent_2":"Global warming cannot cause global temperatures to increase 90 degrees Celsius in one year.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"If it is currently January, children who are in school will have to wait six months before they can go on a three month camping trip.","sent_2":"If it is currently April, children who are in school will have to wait six months before they can go on a three month camping trip.","label_1":"True","label_2":"False","domain":"time","scenario":"causal","numeracy":"True"},{"sent_1":"Not expecting to stop for lunch after school, Sally told her mom she would be home at noon.","sent_2":"Not expecting to stop for lunch after school, Sally told her mom she would be home at midnight.","label_1":"False","label_2":"True","domain":"time","scenario":"causal","numeracy":"False"},{"sent_1":"My grocery shopping trips usually take closer to 60 minutes than 60 seconds.","sent_2":"My grocery shopping trips usually take closer to 60 seconds than 60 minutes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Paul gets his lottery winning at the end of March. He would go on a shopping spree in April rather than in February.","sent_2":"Paul gets his lottery winning at the end of March. He would go on a shopping spree in February rather than in April.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Thirty years ago, I got a dog and a tortoise, and I still have the same tortoise.","sent_2":"Thirty years ago, I got a dog and a tortoise, and I still have the same dog.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A work of art that is 500 years old is likely to be more valued than art that is 5000 days old.","sent_2":"A work of art that is 500 years old is not likely to be more valued than art that is 5000 days old.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Meredith's friend will arrive for dinner in 15 minutes, so she should start to make sandwiches rather than roast a turkey for their meal. ","sent_2":"Meredith's friend will arrive for dinner in 15 minutes, so she should start to roast a turkey rather than make sandwiches for their meal.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Sophie wanted to look good for her vacation the next month so she decided to cancel her gym membership today rather than extending it for another month.","sent_2":"Sophie wanted to look good for her vacation the next month so she decided to cancel her gym membership next month rather than canceling it immediately.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"It's safer to eat yogurt that is 2 months old, rather than yogurt that is 4 days old.","sent_2":"It's safer to eat yogurt that is 4 days old, rather than yogurt that is 2 months old.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Since she has to leave for school in five minutes, it would be better to have a granola bar for breakfast than it would be to cook bacon and eggs.","sent_2":"Since she has to leave for school in five minutes, it would be better to cook bacon and eggs for breakfast than it would be have a granola bar.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"I will come home from work for 1 hour before lunch, and I'll come home again for the night around 5:30 p.m., so I should read the 200-page book when I come home before lunch rather than when I come home for the night.","sent_2":"I will come home from work for 1 hour before lunch, and I'll come home again for the night around 5:30 p.m., so I should read the 200-page book when I come home for the night rather than when I come home for lunch.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"With the fashion show starting in two hours, Marta would sew the ripped dress herself rather than go to a tailor.","sent_2":"With the fashion show starting in two days, Marta would sew the ripped dress herself rather than go to a tailor.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Human society will change more in one decade than it will in one millennium. ","sent_2":"Human society will change less in one decade than it will in one millennium. ","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Because I am going to a buffet in 2 hours, it is best I eat a big meal rather than a snack.","sent_2":"Because I am going to a buffet in 2 hours, it is best I eat a snack rather than a big meal.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"My exam is tomorrow, so I will study tonight and party in two days.","sent_2":"My exam is tomorrow, so I will party tonight and study in two days.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Jane had to leave the house in a few minutes, so she decided to wash her hair tomorrow instead of right now.","sent_2":"Jane had to leave the house in a few minutes, so she decided to wash her hair right now instead of tomorrow.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"If i go to the office early i have the lesser chance of completing my work","sent_2":"If i go to the office early i have the higher chance of completing my work","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Since the movie previews will not be over for two minutes, I have time to go stand in line and buy refreshments.","sent_2":"Since the movie previews will not be over for ten minutes, I have time to go stand in line and buy refreshments.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"It will take less time to dry your hair using the hair dryer than just the fan.","sent_2":"It will take more time to dry your hair using the hair dryer than just the fan.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"I just boarded my flight from New York to London for a very important business meeting.  If I do not want to keep people waiting, I should schedule my crucial meeting for two hours from now instead of nine hours.","sent_2":"I just boarded my flight from New York to London for a very important business meeting.  If I do not want to keep people waiting, I should schedule my crucial meeting for nine hours from now instead of two hours.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"She did not have enough time to eat her sandwich so instead she settled for a full meal.","sent_2":"She did not have enough time to eat her sandwich so instead she settled for a doughnut hole.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Nora had an important meeting to catch in an hour, so she decided to eat a four course meal instead of eating just an appetizer.","sent_2":"Nora had an important meeting to catch in an hour, so she decided to eat an appetizer instead of eating a four course meal.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Tim was picking between 2 cars, and he preferred the one that's been driven for 3 years rather than 1.","sent_2":"Tim was picking between 2 cars, and he preferred the one that's been driven for 1 year rather than 3.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Since objects free-fall at a constant rate of acceleration, Jack knew it would be faster to move his piano down the stairs instead of up the stairs. ","sent_2":"Since objects free-fall at a constant rate of acceleration, Jack knew it would be faster to move his piano up the stairs instead of down the stairs. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"As she felt very sick she fixed an appointment with the doctor today and not for tomorrow","sent_2":"As she felt very sick she fixed an appointment with the doctor tomorrow and not for today.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"A person who works at night is more likely to fall asleep during the day than a person who sleeps at night.","sent_2":"A person who works at night is less likely to fall asleep during the day than a person who sleeps at night.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"After a shower, I will need to take about two minutes instead of an hour to dry off with a towel before putting on my clothes.","sent_2":"After a shower, I will need to take about an hour instead of two minutes to dry off with a towel before putting on my clothes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A game that came out 10 years ago is likely to have better graphics than a game that came out 1 year ago.","sent_2":"A game that came out 1 year ago is likely to have better graphics than a game that came out 10 years ago.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Jenny knew her mother's birthday was coming next week so she bought a present for her today instead of next month.","sent_2":"Jenny knew her mother's birthday was coming next week so she prepared for a party for her next month instead of today.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"John wants to sleep early after working so he should begin his three-hour assignment by 8:00 PM rather than 5:00 PM","sent_2":"John wants to sleep late after working so he should begin his three-hour assignment by 8:00 PM rather than 5:00 PM","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Laura was given twenty minutes for a lunch break so she decided to go to Burger King instead of an upscale restaurant.","sent_2":"Laura was given twenty minutes for a lunch break so she decided to go to an upscale restaurant instead of Burger King.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"The produce delivery is at 9 am. The restaurant employees therefore start prepping at 8 am instead of 10 am.","sent_2":"The produce delivery is at 9 am. The restaurant employees therefore start prepping at 10 am instead of 8 am.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"To keep the kids' attention, its best to provide breaks every 30 minutes rather than 180 minutes.","sent_2":"To keep the kids' attention, its best to provide breaks every 180 minutes rather than 30 minutes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"I am not a morning person. So, I usually wake up at 11 am rather than at 6 am.","sent_2":"I am not a morning person. So, I usually wake up at 6 am rather than at 11 am. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A quarter dollar coin from the 1800s is likely to be more valuable than a quarter dollar coin from 2001 in the same grade.","sent_2":"A quarter dollar coin from the 1800s is likely to be more circulated than a quarter dollar coin from 2001 in the same grade.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Joe is trying to leave work as soon as possible, so he should take the last order now instead of in half an hour. ","sent_2":"Joe is trying to leave work as soon as possible, so he should take the last order in half an hour instead of now. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"If you want to send warm mittens to a friend in New York, it would be better to do so in June than in December.","sent_2":"If you want to send warm mittens to a friend in New York, it would be better to do so in December than in June.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"My flight is at 4PM, and the airport is one hour away, so I can leave at 2PM, but not 4PM, and be there on time.","sent_2":"My flight is at 4PM, and the airport is one hour away, so I can leave at 4PM, but not 2PM, and be there on time.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Rebecca is 7 months pregnant, so she should buy baby clothes in the next six weeks instead of six months.","sent_2":"Rebecca is 7 months pregnant, so she should buy baby clothes in the next six months instead of six weeks.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Natasha's fiancé is serving in the military for two years. So she decided to have a wedding and a honeymoon in three years instead of today.","sent_2":"Natasha's fiancé is serving in the military for two years. So she decided to have a wedding and a honeymoon today instead of in three years.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If I have applied a bandage to a wound, I should make sure to change it every twenty-four hours to keep it fresh instead of every twenty minutes.","sent_2":"If I have applied a bandage to a wound, I should make sure to change it every twenty minutes to keep it fresh instead of every twenty-four hours.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Rachel is five years old. Her parents decided to get her golf clubs now instead of in fifteen years.","sent_2":"Rachel is five years old. Her parents decided to get her golf clubs in fifteen years instead of now.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"My boss is scheduling my yearly performance review, so 50 hours is a better amount of time for the meeting than 50 minutes.","sent_2":"My boss is scheduling my yearly performance review, so 50 minutes is a better amount of time for the meeting than 50 hours.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If the weather forecast tells me to expect rain soon, they usually mean it'll come within the next day rather than the next second.","sent_2":"If the weather forecast tells me to expect rain soon, they usually mean it'll come within the next second rather than the next day.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Sandra's flight to New York leaves at midnight. She decided to check her bags in at 10 pm instead of 10 am.","sent_2":"Sandra's flight to New York leaves at midnight. She decided to check her bags in at 10 am instead of 10 pm.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Vegetables that have been refrigerated for fourteen days will be worse off than those that have been left for a week.","sent_2":"Vegetables that have been refrigerated for fourteen days will be better off than those that have been left for a week.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Joe only has fifteen minutes for lunch, so he's making a sandwich instead of a casserole.","sent_2":"Joe only has fifteen minutes for lunch, so he's making a casserole instead of having a sandwich.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"To allow for people to use the bathroom during the play, an intermission should occur five minutes before the end instead of half way through.","sent_2":"To allow for people to use the bathroom during the play, an intermission should occur half way through instead of five minutes before the end.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Sam has a business meeting at 12:00 pm. So he decided to hang out with friends around 3:00 pm rather than at 11:30 am.","sent_2":"Sam has a business meeting at 12:00 pm. So he decided to hang out with friends around 11:30 am rather than at 3:00 pm.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Larry has a test tomorrow for his college class. He has not studied at all. Therefore, it would make more sense for him to study for his test for an hour instead of hang out with his friends. ","sent_2":"Larry has a test tomorrow for his college class. He has not studied at all. Therefore, it would make more sense for him to hang out with his friends for an hour instead of studying for an hour. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"I usually dry my washed clothes on a clothesline, but if I'm in a hurry, I use the dryer.","sent_2":"I usually dry my washed clothes in the dryer, but if I'm in a hurry, I hang them on a clothesline.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Caroline had an interview yesterday, so she is expecting to receive a response after a week rather than a year.","sent_2":"Caroline had an interview yesterday, so she is expecting to receive a response after a year rather than a week.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Because of my job being most active during weekdays, I decided to attend the Sunday party instead of the Tuesday party.","sent_2":"Because of my job being most active during weekends, I decided to attend the Sunday party instead of the Tuesday party.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Because Joe is attending a bachelor party Friday night, he wants to have an early breakfast with his mom on Sunday instead of Saturday.","sent_2":"Because Joe is attending a bachelor party Friday night, he wants to have an early breakfast with his mom on Saturday instead of Sunday.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"If I am just about to sing a song for karaoke, I should ask my friend to watch my belongings for seventy minutes instead of three minutes.","sent_2":"If I am just about to sing a song for karaoke, I should ask my friend to watch my belongings for three minutes instead of seventy minutes.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"When John was born, his grandmother decided to give him Lego toys in 8 years instead of in 18 years.","sent_2":"When John was born, his grandmother decided to give him college funds in 8 years instead of in 18 years.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"I'm teaching my 8 year old daughter to ride a bike. I expect it will take her closer to 5 months to learn rather than 5 years.","sent_2":"I'm teaching my 8 year old daughter to ride a bike. I expect it will take her closer to 5 years to learn rather than 5 months.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"The game I'm excited for comes out next year rather than next month, so I won't get a preorder yet.","sent_2":"The game I'm excited for comes out next month rather than next year, so I won't get a preorder yet.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"If I just flipped a coin into the air to make a decision, I should reach out to catch it twenty seconds later rather than one second.","sent_2":"If I just flipped a coin into the air to make a decision, I should reach out to catch it one second later rather than twenty seconds.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Sally wants to save money during her holiday, so she should take a one-hour drive to the beach instead of the one-hour flight to a resort. ","sent_2":"Sally wants to save money during her holiday, so she should take a one-hour flight to a resort instead of the one-hour drive to the beach.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If plane leaves tomorrow morning, Alessia should pack her things now instead of tomorrow","sent_2":"If plane leaves day after tomorrow, Alessia should pack her things tomorrow instead of next week","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"In the summer i take out my heavy coat and put away my light coat","sent_2":"In the summer i put away my heavy coat and take out my light coat","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"A coin minted 100 years ago is likely to be shinier than a coin minted 1 year ago.","sent_2":"A coin minted 100 years ago is likely to be less shiny than a coin minted 1 year ago.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Mike's credit card payment was due in one day, so he decided to mail the payment out today instead of paying online tomorrow.","sent_2":"Mike's credit card payment was due in one day, so he decided to pay online tomorrow instead of mailing a check today.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Tony had been in school for 2 months so the semester was almost over.","sent_2":"Tony had been in school for 4 months so the semester was almost over.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"John has been pumping his balloon for over ten seconds, Peter for five seconds. These balloons burst after ten seconds of pumping,  so by now Peter's balloon is bigger than John's","sent_2":"John has been pumping his balloon for over ten seconds, Peter for five seconds. These balloons burst after ten seconds of pumping,  so by now Peter's balloon is smaller than John's","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Paula plans to go on a vacation for a month. She decided to buy cartons of milk now instead of in a month.","sent_2":"Paula plans to go on a vacation for a month. She decided to buy cartons of milk in a month instead of now.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"When putting a cookie in your mouth, it typically starts to get soft after three seconds rather than three minutes.","sent_2":"When putting a cookie in your mouth, it typically starts to get soft after three minutes rather than three seconds.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Having a job with salary of $6000 per month with incidental expenses of $1000 per month is better than a job with salary of $7000 per month with incidental expenses of $3000 per month.","sent_2":"Having a job with salary of $7000 per month with incidental expenses of $3000 per month is better than a job with salary of $6000 per month with incidental expenses of $1000 per month.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Since the meeting ended early, she has time to go over her emails instead of rushing to her next appointment.","sent_2":"Since the meeting ended late, she has time to go over her emails instead of rushing to her next appointment.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"The movie starts at 9pm so we should plan to have dinner at 6pm not 930pm","sent_2":"The movie starts at 9pm so we should plan to have dinner at 930pm not 6pm","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Patrick has a meeting in three hours. After drinking a beer, he probably wants to start driving in one hour rather than in 10 minutes.","sent_2":"Patrick has a meeting in three hours. After drinking a beer, he probably wants to start driving in ten minutes rather than in one hour.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"The next election is in 6 months, so that candidate should start campaigning in a month rather than in a year.","sent_2":"The next election is in 6 months, so that candidate should start campaigning in a year rather than in a month.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"The movie started in five minutes, so he planned to do his grocery shopping afterward instead of before the movie.","sent_2":"The movie started in five minutes, so he planned to do his grocery shopping before the movie instead of afterward.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Given that she must start work in ten minutes, she should have a granola bar instead of making waffles from scratch.","sent_2":"Given that she must start work in ten minutes, she should make waffles from scratch instead of have a granola bar.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Maggie is returning home for the holidays from college, so she will want to get a flight on her last day of vacation instead of her first day.","sent_2":"Maggie is returning home for the holidays from college, so she will want to get a flight on her first day of vacation instead of her last day.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"David is going to pick something he ordered from a store tomorrow, but the store only opens when he is at his work nearby, so he is going to request his boss a 30 minutes exit pass instead of a day off.","sent_2":"David is going to pick something he ordered from a store tomorrow, but the store only is open when he is at his work nearby, so he is going to request his boss a day off instead of a 30 minutes exit pass.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Jason is very hungry, so we would prefer to eat dinner in 30 minutes instead of in 55 minutes.","sent_2":"Jason is very hungry, so we would prefer to eat dinner in 55 minutes instead of in 30 minutes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Because the garbage man comes on Monday morning, Ryan should take his trash at the road on Thursday evening rather than Sunday evening.","sent_2":"Because the garbage man comes on Monday morning, Ryan should take his trash at the road on Sunday evening rather than Thursday evening.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Since I am moving in a few months, I would prefer to pack my clothes later rather than now.","sent_2":"Since I am moving in a few months, I would prefer to pack my clothes now rather than later.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"April has a dinner date with her boyfriend at 5 pm. So she decided to have a lunch at 3 pm instead of 12 pm.","sent_2":"April has a dinner date with her boyfriend at 5 pm. So she decided to skip a lunch instead of having one at 3 pm.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If it's winter time, Tim should turn the temperature up instead of down","sent_2":"If it's summer time, Tim should turn the temperature up instead of down","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"If there will be heavy rain tomorrow, we should rather have a short indoor picnic instead of an all day beach tour.","sent_2":"If there will be heavy rain tomorrow, we should rather go on an all day long beach tour instead of a short indoor picnic.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"It's almost midnight and Chris has a test early tomorrow, so he is going to go to bed in one hour rather than in four hours.","sent_2":"It's almost midnight and Chris has a test early tomorrow, so he is going to go to bed in four hours rather than in one hour.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If Joline has an important paper due tomorrow that will take a full day to research and type, but wants to visit the circus before it leaves town in three days, she will have to do her paper first instead of going to the circus first.","sent_2":"If Joline has an important paper due tomorrow that will take a full day to research and type, but wants to visit the circus before it leaves town in three days, she will have to go to the circus first instead of doing her paper first.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Dave had to wait for the program to install so he went the kitchen for a snack instead of vacationing in Paris.","sent_2":"Dave had to wait for the program to install so he went for a vacation in Paris instead of going to the kitchen for a snack.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Studying 4 hours per day would make it easier for you to finish your lessons than studying 2 hours per day.","sent_2":"Studying 2 hours per day would make it easier for you to finish your lessons than studying 4 hours per day.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Her oldest daughter was born in 1970, and her other two daughters were born in 1973 and 1967.","sent_2":"Her oldest daughter was born in 1973, and her other two daughters were born in 1970 and 1967.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Jared has a big test on Wednesday, so he wants to go the basketball game on Thursday night, instead of Tuesday night so he has time to study.","sent_2":"Jared has a big test on Wednesday, so he wants to go the basketball game on Tuesday night, instead of Thursday night so he has time to study.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Though they are both 5 years ago, the child both in January is usual more developed than the child born in December","sent_2":"Though they are both 5 years ago, the child both in December is usual more developed than the child born in January","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If I want to drink a soda that is more flat, I would leave my drink out for four hours rather than four minutes.","sent_2":"If I want to drink a soda that is more flat, I would leave my drink out for four minutes rather than four hours.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"I wanted to sleep in and intentionally miss school, so I stayed up until 1:00 AM instead of 10:00 PM.","sent_2":"I wanted to sleep in and intentionally miss school, so I stayed up until 10:00 PM instead of 1:00 AM.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Having to go to bed in ten minutes, she should go to shower instead of using the bath tub.","sent_2":"Having to go to bed in ten minutes, she should use the bath tub instead of going to shower.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If he plans to retire in 5 years, he will want to pay off all of his debt in 10 years rather than in 4 years.","sent_2":"If he plans to retire in 5 years, he will want to pay off all of his debt in 4 years rather than in 10 years.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Since her alarm will not go off for two minutes, she should go back to sleep instead of getting up for the day.","sent_2":"Since her alarm will go not off for two hours, she should go back to sleep instead of getting up for the day.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Katie is running late for work and needs to shower. It would make more sense if she waited until tomorrow’s shower to wash her hair and shave her legs instead of doing it in today’s shower. ","sent_2":"Katie is running late for work and needs to shower. It would make less sense if she waited until tomorrow’s shower to wash her hair and shave her legs instead of doing it in today’s shower. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"To keep the audience interested in the play, it is best to set the intermission after the second act instead of after the curtain goes up.","sent_2":"To keep the audience interested in the play, it is best to set the intermission after the curtain goes up instead of after the second act.  ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"There is only about five minutes worth of hot water in the hot water tank, so a five minute shower will be better instead of a twenty minute one.","sent_2":"There is only about five minutes worth of hot water in the hot water tank, so a twenty minute shower will be better than a five minute one.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A person has more knowledge about the world at the age of 3 months than they do at the age of 13 years.","sent_2":"A person has less knowledge about the world at the age of 3 months than they do at the age of 13 years.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Since she just painted her fingernails, Sally should wait 5 minutes before getting dressed rather than changing now.","sent_2":"Since she just painted her fingernails, Sally should get changed now rather than wait 5 minutes ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Contemporary building is more likely to resist an earthquake than ancient building","sent_2":"Contemporary building has more chances of being damaged in an earthquake than ancient building","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"If I am going to be Abraham Lincoln for Halloween and want to grow an authentic beard, I should make sure to stop shaving two months before Halloween instead of three days.","sent_2":"If I am going to be Abraham Lincoln for Halloween and want to grow an authentic beard, I should make sure to stop shaving three days before Halloween instead of two months.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Jane wants to get enough sleep and get to work by 8:00 AM. If she will take at least an hour to get ready, she should set an alarm for 6:10 AM rather than 7:10 AM","sent_2":"Jane wants to get enough sleep and get to work by 8:00 AM. If she will take at most ten minutes to get ready, she should set an alarm for 6:10 AM rather than 7:10 AM","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Danny had ten minutes to buy Jenny a birthday present. He decided to pick up a gift card instead of buying a new dress.","sent_2":"Danny had ten minutes to buy Jenny a birthday present. He decided to buy a new dress instead of picking up a gift card.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A diurnal animal is more likely to find prey at night than during daytime","sent_2":"A diurnal animal is less likely to find prey at night than during daytime","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Because Tony has to be at work in 1 hour, he should take a 10 minute shower instead of an hour long shower.","sent_2":"Because Tony has to be at work in 1 hour, he should take a hour long shower instead of a 10 minute shower.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A car that is driven for 5 years rather than 3 years is more valuable.","sent_2":"A car that is driven for 3 years rather than 5 years is more valuable.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Paula has a basketball tournament coming up. So she practices six times a week instead of six times a year.","sent_2":"Paula has a basketball tournament coming up. So she practices six times a year instead of six times a week.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"A twelfth century used book is likely to be more valuable than the new book I purchased yesterday from a bookstore.","sent_2":"A twelfth century used book is likely to be more worn out than the new book I purchased yesterday from a bookstore.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Having to leave for work within the hour, Stacey decided she would have time for a cat nap rather than a traditional siesta.","sent_2":"Having to leave for work within the hour, Stacey decided she would have time for a traditional siesta rather than a cat nap.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"With the sale contract to be signed on Friday, Jack plans to deliver the goods next week instead of this week.","sent_2":"With the sale contract to be signed on Friday, Jack plans to deliver the goods this week instead of next week.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Joey was a much more skillful boxer after 300 days of training than he was after 300 minutes of training.","sent_2":"Joey was a much more skillful boxer after 300 minutes of training than he was after 300 days of training.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Amy wants to pass an hour while waiting for the train so she is more likely to go to a restaurant to eat in rather than order a take out.","sent_2":"Amy wants to pass five minutes while waiting for the train so she is more likely to go to a restaurant to eat in rather than order a take out.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Josh has hockey practice tomorrow morning, so he should stop drinking before midnight instead of after. ","sent_2":"Josh has hockey practice tomorrow morning, so he should stop drinking after midnight instead of before. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Since a 13-day project is only four days behind on its deadline, it is more reasonable to request for an additional month than an additional week","sent_2":"Since a 13-day project is only four days behind on its deadline, it is less reasonable to request for an additional month than an additional week","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Yoshi became sick after eating the burger because it was cooked for 2 minutes instead of the required 10 minutes.","sent_2":"Yoshi became sick after eating the burger because it was cooked for the required 10 minutes instead of 2 minutes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":" With the party starting in half an hour, Tim will take a rushed shower rather than taking a long bath.","sent_2":" With the party starting in few hours, Tim will take a rushed shower rather than taking a long bath.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Since he has to wake up at four a.m. for work, he should go to bed before midnight instead of after midnight. ","sent_2":"Since he has to wake up at four a.m. for work, he should go to bed after midnight instead of before midnight. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Having to work night shift tonight, John wakes up at 4 pm rather than 7 am.","sent_2":"Having to work night shift tonight, John wakes up at 7 am rather than 4 pm.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"I wanted to plan a trip to Niagara Falls when it's warmer outside, so I planned the trip for June instead of January.","sent_2":"I wanted to plan a trip to Niagara Falls when it's warmer outside, so I planned the trip for January instead of June.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Because Tim overslept, he will grab a fast food meal from the restaurant next door to the office instead of cooking pancakes and sausage.","sent_2":"Because Tim overslept, he will cook pancakes and sausage instead of grabbing a fast food meal from the restaurant next door to the office.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"John has an appointment in Germany on Thursday. So he left US this Tuesday instead of this Saturday.","sent_2":"John has an appointment in Germany on Thursday. So he left US this Saturday instead of this Tuesday.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"A car takes off three minutes after a space wagon at the same speed. The space wagon crashes five minutes later, so after ten minutes the space wagon has travelled further than the car.","sent_2":"A car takes off three minutes after a space wagon at the same speed. The space wagon crashes five minutes later, so after ten minutes the car has travelled further than the space wagon.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Because Martin has birthday on Saturday, he should get his outfit on Thursday instead of Sunday","sent_2":"Because Martin has birthday on Friday, he should get his outfit on Saturday instead of Sunday","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Tim read that it was going to rain tomorrow so he requested 2 day shipping, instead of overnight shipping, on the umbrella he ordered.","sent_2":"Tim read that it was going to rain tomorrow so he requested overnight shipping, instead of 2 day shipping, on the umbrella he ordered.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Using air conditioner for 8 hours per day would ensure lesser electricity consumption than using it for the wholeday. ","sent_2":"Using air conditioner for 8 hours per day would cause higher electricity consumption than using it for the wholeday. ","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If I want a nice glass of milk and cookies to relax, I would rather use the milk that has been in the fridge for eight days than the one that has been in there for two days.","sent_2":"If I want a nice glass of milk and cookies to relax, I would rather use the milk that has been in the fridge for two days than the one that has been in there for eight days.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Laura is accommodating guests from out of state for a two hour lunch. So she decides to take them to McDonald's rather than a formal restaurant.","sent_2":"Laura is accommodating guests from out of state for a two hour lunch. So she decides to take them to a formal restaurant rather than McDonald's.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"John's plane leaves on Monday at 6 am so he has to start packing on Sunday instead of Tuesday","sent_2":"John's plane leaves on Monday at 6 am so he has to start packing on Monday instead of Tuesday","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Having to go out in two minutes, Carl should wear slip-on shoes instead of sneakers.","sent_2":"Having to go out in two minutes, Carl should wear sneakers instead of slip-on shoes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Since Sally is very tired right now she will clean the kitchen in the morning instead of tonight.","sent_2":"Since Sally is very tired right now she will clean the kitchen tonight instead of in the morning.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"False"},{"sent_1":"Naomi has a short attention span, so she would have an easier time watching a 1 hour movie instead of a 3 hour movie.","sent_2":"Naomi has a short attention span, so she would have an easier time watching a 3 hour movie instead of a 1 hour movie.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Having to teach a night class in thirty minutes, he should make a frozen meal instead of a three-course dinner.","sent_2":"Having to teach a night class in thirty minutes, he should make a three-course dinner instead of a frozen meal.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"Barry wants to see a movie with a friend in three days time. He should have told his friend about it four days ago rather than today to give them a week's notice","sent_2":"Barry wants to see a movie with a friend in three days time. He should tell his friend about it today rather than four days ago to give them a week's notice","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"If the movie comes out tomorrow, he should make plans to watch it today rather than 2 days from now.","sent_2":"If the movie comes out tomorrow, he should make plans to watch it 2 days from now rather than today.","label_1":"False","label_2":"True","domain":"time","scenario":"comparison","numeracy":"True"},{"sent_1":"It is easier to run one mile in ten minutes, than it is to run two miles in five minutes.","sent_2":"It is easier to run two miles in five minutes than it is to run one mile in ten minutes.","label_1":"True","label_2":"False","domain":"time","scenario":"comparison","numeracy":"True"}]